Repository: 3x0dv5/docs
Catalog: translated/*/announcements_all.po
Languages: es, fr

source: MapServer 5.6.1 has been released. See `the release announcement <http://lists.osgeo.org/pipermail/mapserver-users/2010-January/064120.html>`__ for more details and head to :ref:`download` to obtain a copy.
fr: MapServer 5.6.1 vient d'être publié. Voir `l'annonce de publication <http://lists.osgeo.org/pipermail/mapserver-users/2010-January/064120.html>`__ pour plus de détails et allez à la page de :ref:`téléchargement <download>` pour obtenir une copie.

source: **2009-12-18 - MapServer 5.6.0 is released**
es: **2009-12-18 - MapServer 5.6.0 liberado**
fr: **18-12-2009 - MapServer 5.6.0 est publié**

source: MapServer 5.6.0 has been released. See `the release announcement <http://lists.osgeo.org/pipermail/mapserver-users/2009-December/064001.html>`__ for more details and head to :ref:`download` to obtain a copy.
fr: MapServer 5.6.0 vient d'être publié. Voir `l'annonce de publication <http://lists.osgeo.org/pipermail/mapserver-users/2009-December/064001.html>`__ pour plus de détails et allez à la page de :ref:`téléchargement <download>` pour obtenir une copie.

source: **2009-07-24 - MapServer 5.4.2 is released**
es: **2009-07-24 - MapServer 5.4.2 liberado**
fr: **24-07-2009 - MapServer 5.4.2 est publié**

source: MapServer 5.4.2 has been released. See the `Changelog <http://trac.osgeo.org/mapserver/browser/tags/rel-5-4-2/mapserver/HISTORY.TXT>`__ for more details and head to :ref:`download` to obtain a copy.
fr: MapServer 5.6.0 vient d'être publié. Voir `le log des changements <http://trac.osgeo.org/mapserver/browser/tags/rel-5-4-2/mapserver/HISTORY.TXT>`__ pour plus de détails et allez à la page de :ref:`téléchargement <download>` pour obtenir une copie.

source: **2009-06-01 - MapServer 5.4.1 is released**
es: **2009-06-01 - MapServer 5.4.1 liberado**
fr: **01-06-2009 - MapServer 5.4.1 est publié**

source: MapServer 5.4.1 has been released. See the `Changelog <http://trac.osgeo.org/mapserver/browser/tags/rel-5-4-1/mapserver/HISTORY.TXT>`__ for more details and head to :ref:`download` to obtain a copy.
fr: MapServer 5.4.1 vient d'être publié. Voir `le log des changements <http://trac.osgeo.org/mapserver/browser/tags/rel-5-4-1/mapserver/HISTORY.TXT>`__ pour plus de détails et allez à la page de :ref:`téléchargement <download>` pour obtenir une copie.

source: **2009-04-22 - MapServer 5.4 is released**
es: **2009-04-22 - MapServer 5.4 liberado**
fr: **22-04-2009 - MapServer 5.4 est publié**

source: MapServer 5.4 has been released. See the `Changelog <http://trac.osgeo.org/mapserver/browser/tags/rel-5-4-0/mapserver/HISTORY.TXT>`__ for more details and head to :ref:`download` to obtain a copy.
fr: MapServer 5.4 vient d'être publié. Voir `le log des changements <http://trac.osgeo.org/mapserver/browser/tags/rel-5-4-0/mapserver/HISTORY.TXT>`__ pour plus de détails et allez à la page de :ref:`téléchargement <download>` pour obtenir une copie.

source: **2009-03-26 - MapServer 5.2.2 and 4.10.4 security fixes are released**
es: **2009-03-26 - Correcciones de seguridad de MapServer 5.2.2 y 4.10.4 fueron liberados*
fr: **26-03-2008 - MapServer 5.2.2 et 4.10.4 sont publiés avec des patchs de sécurité**

source: MapServer 5.2.2 and 4.10.4 have been released, containing important security fixes. See the `Announcement <http://lists.osgeo.org/pipermail/mapserver-users/2009-March/060600.html>`__ for more details and head to :ref:`download` to obtain copies.
fr: MapServer 5.2.2 et 4.10.4 viennent d'être publiés, avec des patchs de sécurité importants. Voir `l'annonce de publication <http://lists.osgeo.org/pipermail/mapserver-users/2009-March/060600.html>`__ pour plus de détails et allez à la page de :ref:`téléchargement <download>` pour obtenir une copie.

source: **2009-03-08 - MapServer PSC Attend Toronto Code Sprint**
fr: **08-03-2009 - Les développeurs de MapServer participent au Code Sprint de Toronto**

source: Members of the MapServer Project Steering Committee attend the `Toronto Code Sprint <http://wiki.osgeo.org/wiki/Toronto_Code_Sprint_2009>`__ event, an international meeting of GDAL, PostGIS, OpenLayers, and MapServer development teams.
fr: Les membres de l'équipe MapServer participent au `Code Sprint de Toronto <http://wiki.osgeo.org/wiki/Toronto_Code_Sprint_2009>`__ , une rencontre internationale des équipes de développement des projets PostGIS, GDAL, OpenLayers et MapServer.

source: **2008-12-30 - New MapServer website is now live**
fr: **30-12-2008 - Le nouveau site web de MapServer est maintenant en ligne**

source: The new, improved MapServer website is now live! Welcome to the new MapServer website. Some of the major improvements include:
fr: Le nouveau site web de MapServer est maintenant en ligne ! Bienvenue sur le nouveau site. Quelques unes des améliorations majeures incluent :

source: An updated :ref:`gloss`
fr: Un :ref:`gloss` mis à jour

source: A significantly improved :ref:`introduction`
fr: Une :ref:`introduction` améliorée de manière significative

source: All documentation is now available in a single, 600+ page `PDF <./MapServer.pdf>`__
fr: Toute la documentation est maintenant disponible dans un seul fichier `PDF <./MapServer.pdf>`__ de plus de 600 pages

source: More internal document referencing, better styling, and mapfile styling,
fr: Plus de références internes dans les documents, un style plus sympathique, et des mapfile stylés,

source: Simpler organizational structure
fr: Une structure organisée de manière plus simple

source: **2008-12-16 - MapServer Graduates OSGeo Incubation**
fr: **16-12-2008 - MapServer a passé la phase d'incubation de l'OSGeo**

source: MapServer recently graduated OSGeo's Incubation process. Incubation includes ensuring items like code provenance and community contribution. See the `announcement`_ for more details.
fr: MapServer vient récemment de passer le processus d'incubation de l'OSGeo. L'incubation inclue la vérification des différents éléments comme la provenance du code et la contribution de la communauté. Voir l'`announcement`_ pour plus de détails.
