Repository: 3x0dv5/docs
Catalog: translated/*/announcements_all.po
Languages: es, fr

source: MapServer Announcements
es: Anuncios de MapServer
fr: Annonces MapServer

source: **2015-02-12 - MapServer 7.0.0-beta1 is released**
es: **2015-02-12 - MapServer 7.0.0-beta1 liberado**
fr: **2015-02-12 - MapServer 7.0.0-beta1 est publié**

source: The first beta for MapServer 7.0 has been released. The list of major changes for this release can be found in the :ref:`7.0 announcement <announce-7-0>`. See the :ref:`changelog <changelog-7-0>` for the full list of changes and head to :ref:`download` to obtain a copy.
es: El primer beta para MapServer 7.0 fue libreado. La lista de los cambios de esta versión puede encontrase en en el :ref:`anuncio 7.0 <announce-7-0>`. Ver la :ref:`lista de cambios <changelog-7-0>` para la lista completa de cambios y en la sección de :ref:`descarga` para obtener una copia.
fr: La première bêta de MapServer 7.0 a été publiée. La liste des modifications importantes pour cette version peut être trouvée sur la page des :ref:`7.0 annonces <announce-7-0>`. Lisez le :ref:`changelog <changelog-7-0>` pour la liste complète des modifications et dirigez vous sur la page des :ref:`download` pour en obtenir une copie.

source: **2014-01-03 - MapCache 1.2.1 is released**
es: **2014-01-03 - MapCache 1.2.1 liberado**
fr: **01-03-2014 - MapCache 1.2.1 est publié**

source: MapCache 1.2.1 has been released. Head to :ref:`download` to obtain a copy.
es: MapCache 1.2.1 liberado. Fuente en :ref:`descargar` para obtener una copia.
fr: MapCache 1.2.1 a été publié. Rendez-vous au :ref:`téléchargement <download>` pour obtenir une copie.

source: **2014-01-02 - MapServer 6.4.1, 6.2.2, 6.0.4 and 5.6.9 are released**
es: **2014-01-02 - MapServer 6.4.1, 6.2.2, 6.0.4 y 5.6.9 liberados**
fr: **02-01-2014- MapServer 6.4.1, 6.2.2, 6.0.4 et 5.6.9 ont été publiés**

source: Releases for the stable branches of MapServer have been released in order to fix a potential leakage of information through an SQL injection when using TIME filtering in conjunction with postgis backends. More information can be found in the dedicated issue: `#4834 <https://github.com/mapserver/mapserver/issues/4834>`__.
es: Liberaciones para las ramas estables de Mapserver para corregir un potencial perdida de información a través de inyección SQL cuando se usa filtros de TIEMPO en conjunto con PostGIS backends. Mayor información puede encontrase en el caso: `#4834 <https://github.com/mapserver/mapserver/issues/4834>`__.
fr: Des nouvelles publications pour les branches stables de MapServer ont été effectuées afin de corriger une possible fuite d'information via une injection SQL quand le filtrage TIME est utilisé en conjonction avec le back-office PostGIS. Plus d'informations peuvent être trouvées dans le suivi de bug dédié: `#4834 <https://github.com/mapserver/mapserver/issues/4834>`__.

source: Changelogs for each specific version can be found here:
es: Lista de cambios para cada versión específica pueden encontrase aquí:
fr: Les logs de changements pour chaque version spécifique peuvent être trouvés ici :

source: :ref:`6.4.0 to 6.4.1 changes <changelog-6-4-1>`
es: :ref:`Cambios de 6.4.0 a 6.4.1 <changelog-6-4-1>`
fr: :ref:`changements de la version 6.4.0 à 6.4.1 <changelog-6-4-1>`

source: :ref:`6.2.1 to 6.2.2 changes <changelog-6-2-2>`
es: :ref:`Cambios de 6.2.1 a 6.2.2 <changelog-6-2-2>`
fr: :ref:`changements de la version 6.2.1 à 6.2.2 <changelog-6-2-2>`

source: :ref:`6.0.3 to 6.0.4 changes <changelog-6-0-4>`
es: :ref:`Cambios de 6.0.3 a 6.0.4 <changelog-6-0-4>`
fr: :ref:`changements de la version 6.0.3 à 6.0.4 <changelog-6-0-4>`

source: 5.6.9 contains only the fix for #4834
es: 5.6.9 contiene sólo corrección para #4834
fr: La version 5.6.9 contient seulement la correction pour le bug #4834

source: Head to :ref:`download` to obtain copies.
es: Fuente en :ref:`descargar` para obtener copias.
fr: Rendez-vous à la page de :ref:`téléchargement <download>` pour obtenir une copie.

source: **2013-09-17 - MapServer 6.4.0 is released**
es: **2013-09-17 - MapServer 6.4.0 liberado**
fr: **17-09-2013 - MapServer 6.4.0 est publié**

source: MapServer 6.4.0 has been released. Major changes since 6.2 can be found in the :ref:`the 6.4 announcement <announce-6-4>`. For the small list of changes since RC1, see :ref:`the final changelog <changelog-6-4-0>`, then head to :ref:`download` to obtain a copy.
es: MapServer 6.4.0 ha sido liberado. Los mayores cambios desde la versión 6.2 se pueden encontrar en el :ref:`Anuncios 6.4 <announce-6-4>`. Para la lista pequeña de cambios desde RC1 ver :ref:`La lista de cambios finales <changelog-6-4-0>`, luego ir a :ref:`descargas` para obtener una copia.
fr: MapServer 6.4.0 vient d'être publié. Les changements majeurs depuis la 6.2 peuvent être trouvés dans :ref:`l'annonce de publication <announce-6-4>`. Pour une liste des changements depuis la RC1, allez voir :ref:`le changelog final <changelog-6-4-0>` et allez à la page de :ref:`téléchargement <download>` pour obtenir une copie.

source: **2013-09-06 - MapServer 6.4.0-RC1 is released**
es: **2013-09-06 - MapServer 6.4.0-RC1 liberado**
fr: **06-09-2013 - MapServer 6.4.0 RC1 est publié**

source: The first release candidate for MapServer 6.4 has been released. See :ref:`the changelog <changelog-6-4-rc1>` for the full list of changes from beta2 and head to :ref:`download` to obtain a copy.
es: La primer versión candidata para MapServer 6.4 ha sido liberada. Ver :ref:`la lista de cambios <changelog-6-4-rc1>` para la lista completa de cambios de beta2 y dirigirse a :ref:`descargas` para obtener una copia.
fr: La première version en "release candidate" (RC1) de MapServer 6.4 vient d'être publiée. Lisez :ref:`le changelog <changelog-6-4-rc1>` pour une liste de tous les changements depuis la beta2 et allez à la page de :ref:`download` pour obtenir une copie.

source: **2013-08-21 - MapServer 6.4.0-beta2 is released**
es: **2013-08-21 - MapServer 6.4.0-beta2 liberado**
fr: **21-08-2013 - MapServer 6.4.0-beta2 est publié**

source: The second beta for MapServer 6.4 has been released. See :ref:`the changelog <changelog-6-4-beta2>` for the full list of changes from beta1 and head to :ref:`download` to obtain a copy.
es: La segunda beta para MapServer 6.4 ha sido liberada. Vea :ref:`la lista de cambios <changelog-6-4-beta2>` para ver la lista completa de cambios de beta1 y vaya a :ref:`descargas` para obtener una copia.
fr: La seconde version beta de MapServer 6.4 vient d'être publiée. Lisez :ref:`le changelog <changelog-6-4-beta2>` pour une liste de tous les changements à partr de la béta 1 et allez à la page de :ref:`téléchargement <download>` pour obtenir une copie.

source: **2013-08-14 - MapServer 6.4.0-beta1 is released**
es: **2013-08-14 - MapServer 6.4.0-beta1 liberado**
fr: **14-08-2013 - MapServer 6.4.0-beta1 est publié**

source: The first beta for MapServer 6.4 has been released. The list of major changes for this release can be found in the `HISTORY.TXT <https://github.com/mapserver/mapserver/blob/rel-6-4-0-beta1/HISTORY.TXT>`__ file from the source directory. See :ref:`the changelog <changelog-6-4>` for the full list of changes and head to :ref:`download` to obtain a copy.
es: El primer beta para Mapserver 6.4 ha sido liberado. La lista de los principales cambios de esta versión se puede encontrar en el archivo `HISTORY.TXT <https://github.com/mapserver/mapserver/blob/rel-6-4-0-beta1/HISTORY.TXT>`__ desde el directorio origen. Vea :ref:`la lista de cambios <changelog-6-4>` para la lista de completa de cambios y vaya a :ref:`descargas` para obtener una copia.
fr: La première version beta de Mapserver 6.4 a été publiée. La liste des changements majeurs pour cette version peut être trouvée dans le fichier `HISTORY.TXT <https://github.com/mapserver/mapserver/blob/rel-6-4-0-beta1/HISTORY.TXT>`__ depuis le répertoire source.

source: **2013-04-19 - MapServer 6.2.1 is released**
es: **2013-04-19 - MapServer 6.2.1 liberado**
fr: **19-04-2013 - MapServer 6.2.1 est publié**

source: MapServer 6.2.1 has been released. See :ref:`the changelog <changelog-6-2-1>` for more details and head to :ref:`download` to obtain a copy.
es: MapServer 6.2.1 liberado. Ver la :ref:`lista de cambios <changelog-6-2-1>` para mayor detalles y fuente en :ref:`descarga` para obtener una copia.
fr: MapServer 6.2.1 vient d'être publié. Voir :ref:`l'annonce de publication <changelog-6-2-1>` pour plus de détails et allez au :ref:`download` pour obtenir une copie.

source: **2012-11-14 - MapServer Suite 12.11 is released**
es: **2012-11-14 - MapServer Suite 12.11 liberado**
fr: **14-11-2012 - MapServer Suite 12.11 est publié**

source: The first MapServer Suite, numbered 12.11, and containing MapServer 6.2.0, MapCache 1.0.0 and TinyOWS 1.1.0 has been released. See :ref:`the release announcement <announce-6-2>` for more details.
es: El primer MapServer Suite, enumerado 12.11 y contiene MapServer 6.2.0, MapCache 1.0.0 y TinyOWS 1.1.0 ha sido liberado. Ver :ref:` Los anuncios de la versión <announce-6-2>` para mayor detalle.
fr: La première MapServer Suite, numérotée 12.11, et contenant MapServer 6.2.0, MapCache 1.0.0 et TinyOWS 1.1.0 vient d'être publiée. Voir :ref:`l'annonce de publication <announce-6-2>` pour plus de détails.

source: **2012-11-14 - MapServer 6.2.0 is released**
es: **2012-11-14 - MapServer 6.2.0 liberado**
fr: **14-11-2012 - MapServer 6.2.0 est publié**

source: MapServer 6.2.0 has been released. See :ref:`the release announcement <announce-6-2>` for more details, :ref:`the changelog since RC1 <changelog-6-2-0>` and head to :ref:`download` to obtain a copy.
es: MapServer 6.2.0 liberado. Ver el :ref:`anuncio de liberación <announce-6-2>` para mayor detalles, :ref:`lista de cambios desde RC1 <changelog-6-2-0>` y fuente en :ref:`descarga` para obtener una copia.
fr: MapServer 6.2.0 vient d'être publié. Voir :ref:`l'annonce de publication <announce-6-2>` pour plus de détails, :ref:`le changelog depuis la RC1 <changelog-6-2-0>` et allez au :ref:`téléchargement <download>` pour obtenir une copie.

source: **2012-10-10- MapServer 6.2.0 RC1 is released**
es: **2012-10-10- MapServer 6.2.0 RC1 liberado**
fr: **10-10-2012 - MapServer 6.2.0 RC1 est publié**

source: MapServer 6.2.0-rc1 has been released. See :ref:`the changelog <changelog-6-2-0-rc1>` for more details and head to :ref:`download` to obtain a copy.
es: MapServer 6.2.0-rc1 ha sido liberado. Ver :ref:` la lista de cambios <changelog-6-2-0-rc1>` para mayor detalle y vaya a :ref:`descargas` para obtener una copia.
fr: MapServer 6.2.0-rc1 vient d'être publié. Voir :ref:`l'annonce de publication <changelog-6-2-0-rc1>` pour plus de détails et allez au :ref:`téléchargement <download>` pour obtenir une copie.

source: **2012-09-27- MapServer 6.2.0 beta4 is released**
es: **2012-09-27- MapServer 6.2.0 beta4 liberado**
fr: **27-09-2012 - MapServer 6.2.0-beta4 est publié**

source: MapServer 6.2.0-beta4 has been released. See :ref:`the changelog <changelog-6-2-0-beta4>` for more details and head to :ref:`download` to obtain a copy.
es: MapServer 6.2.0-beta4 ha sido liberado. Ver :ref:`la lista de cambios <changelog-6-2-0-beta4>` para mayor información y vaya a :ref:`descargas` para obtener una copia.
fr: MapServer 6.2.0-beta4 vient d'être publié. Voir :ref:`l'annonce de publication <changelog-6-2-0-beta4>` pour plus de détails et allez au :ref:`téléchargement <download>` pour obtenir une copie.

source: **2012-09-06- MapServer 6.2.0 beta3 is released**
es: **2012-09-06- MapServer 6.2.0 beta3 liberado**
fr: **06-09-2012 - MapServer 6.2.0-beta3 est publié**

source: MapServer 6.2.0-beta3 has been released. See :ref:`the changelog <changelog-6-2-0-beta3>` for more details and head to :ref:`download` to obtain a copy.
es: MapServer 6.2.0-beta3 ha sido liberado. Ver :ref:`la lista de cambios <changelog-6-2-0-beta3>` para mayor información y vaya a :ref:`descargas` para obtener una copia.
fr: MapServer 6.2.0-beta3 vient d'être publié. Voir :ref:`l'annonce de publication <changelog-6-2-0-beta3>` pour plus de détails et allez au :ref:`téléchargement <download>` pour obtenir une copie.

source: **2012-08-01 - MapServer 6.2.0 beta2 is released**
es: **2012-08-01 - MapServer 6.2.0 beta2 liberado**
fr: **01-08-2012 - MapServer 6.2.0-beta2 est publié**

source: MapServer 6.2.0-beta2 has been released. See :ref:`the changelog <changelog-6-2-0-beta2>` for more details and head to :ref:`download` to obtain a copy.
es: MapServer 6.2.0-beta2 ha sido liberado. Ver :ref:`la lista de cambios <changelog-6-2-0-beta2>` para mayor información y vaya a :ref:`descargas` para obtener una copia.
fr: MapServer 6.2.0-beta2 vient d'être publié. Voir :ref:`l'annonce de publication <announce-6-2-0-beta2>` pour plus de détails et allez au :ref:`téléchargement <download>` pour obtenir une copie.

source: **2012-06-29 - MapServer 6.2.0 beta1 is released**
es: **2012-06-29 - MapServer 6.2.0 beta1 liberado**
fr: **29-06-2012 - MapServer 6.2.0-beta1 est publié**

source: MapServer 6.2.0-beta1 has been released. See `the release announcement <http://lists.osgeo.org/pipermail/mapserver-users/2012-June/072689.html>`__ for more details and head to :ref:`download` to obtain a copy.
fr: MapServer 6.2.0-beta1 vient d'être publié. Voir `l'annonce de publication <http://lists.osgeo.org/pipermail/mapserver-users/2012-June/072689.html>`__ pour plus de détails et allez au :ref:`téléchargement <download>` pour obtenir une copie.

source: **2012-05-18 - MapServer 6.0.3 is released**
es: **2012-05-18 - MapServer 6.0.3 liberado**
fr: **18-05-2012 - MapServer 6.0.3 est publié**

source: MapServer 6.0.3 has been released. See `the release announcement <http://lists.osgeo.org/pipermail/mapserver-users/2012-May/072329.html>`__ for more details and head to :ref:`download` to obtain a copy.
es: MapServer 6.0.3 liberado. Ver el `anuncio de la versión <http://lists.osgeo.org/pipermail/mapserver-users/2012-May/072329.html>`__ para mayor detalles y fuente en :ref:`descargar` para obtener una copia.
fr: MapServer 6.0.3 vient d'être publié. Voir `l'annonce de publication <http://lists.osgeo.org/pipermail/mapserver-users/2012-May/072329.html>`__ pour plus de détails et allez au :ref:`téléchargement <download>` pour obtenir une copie.

source: **2012-02-08 - TinyOWS 1.0.0 is released**
es: **2012-02-08 - TinyOWS 1.0.0 liberado**
fr: **08-02-2012 - TinyOWS 1.0.0 est publié**

source: TinyOWS 1.0.0 has been released. See `the release announcement <http://lists.osgeo.org/pipermail/mapserver-users/2012-February/071478.html>`__ for more details. (Note that TinyOWS will be part of the MapServer project starting with version 6.2)
es: TinyOWS 1.0.0 liberado. Ver `el anuncio de la versión <http://lists.osgeo.org/pipermail/mapserver-users/2012-February/071478.html>`__ para mayor detalles. (Observer que TinyOWS será parte del proyecto Mapserver desde la versión 6.2)
fr: TinyOWS 1.0.0 vient d'être publié. Voir `l'annonce de publication <http://lists.osgeo.org/pipermail/mapserver-users/2012-February/071478.html>`__ pour plus de détails. (Notez aussi que TinyOWS devient partie intégrante du projet MapServer à partir de la version 6.2)

source: **2012-02-08 - MapServer 6.0.2 and 5.6.8 are released**
es: **2012-02-08 - MapServer 6.0.2 and 5.6.8 liberado**
fr: **08-02-2012 - MapServer 6.0.2 et 5.6.8 sont publiés**

source: MapServer 6.0.2 and 5.6.8 have been released, including a security fix. See `the release announcement <http://lists.osgeo.org/pipermail/mapserver-users/2012-February/071476.html>`__ for more details and head to :ref:`download` to obtain a copy.
fr: MapServer 6.0.2 et 5.6.8 viennent d'être publiés, incluant la résolution de bugs de sécurité. Voir `l'annonce de publication <http://lists.osgeo.org/pipermail/mapserver-users/2012-February/071476.html>`__ pour plus de détails et allez à la page de :ref:`téléchargement <download>` pour obtenir une copie.

source: **2012-02-06 - MapServer Developers Attend Seattle Code Sprint**
fr: **06-02-2012 - Les développeurs de MapServer participent au Code Sprint de Seattle**

source: Members of the MapServer Project Steering Committee attend the `Seattle/Islandwood Code Sprint <http://wiki.osgeo.org/wiki/IslandWood_Code_Sprint_2012>`__ event, an international meeting of PostGIS, GDAL, PDAL TinyOWS and MapServer development teams.
fr: Les membres de l'équipe MapServer participent au `Code Sprint de Seattle/Islandwood <http://wiki.osgeo.org/wiki/IslandWood_Code_Sprint_2012>`__ , une rencontre internationale des équipes de développement des projets PostGIS, PDAL, TinyOWS et MapServer.

source: **2011-07-13 - MapServer 6.0.1, 5.6.7 and 4.10.7 are released with security fixes**
es: **2011-07-13 - MapServer 6.0.1, 5.6.7 y 4.10.7 fueron liberados con correcciones de seguridad**
fr: **13-07-2011 - MapServer 6.0.1, 5.6.7 et 4.10.7 sont publiés avec des patchs de sécurité**

source: MapServer 6.0.1, 5.6.7 and 4.10.7 have been released, containing important security fixes. See `the release announcement <http://lists.osgeo.org/pipermail/mapserver-users/2011-July/069430.html>`__ for more details and head to :ref:`download` to obtain a copy.
fr: MapServer 6.0.1, 5.6.7 et 4.10.7 viennent d'être publiés, avec des patchs de sécurité importants. Voir `l'annonce de publication <http://lists.osgeo.org/pipermail/mapserver-users/2011-July/069430.html>`__ pour plus de détails et allez au :ref:`téléchargement <download>` pour obtenir une copie.

source: **2011-05-12 - MapServer 6.0.0 is released**
es: **2011-05-12 - MapServer 6.0.0 liberado**
fr: **12-05-2011 - MapServer 6.0.0 est publié**

source: MapServer 6.0.0 has been released. See :ref:`the release announcement <announce-6-0>` for more details and head to :ref:`download` to obtain a copy.
fr: MapServer 6.0.0 vient d'être publié. Voir `l'annonce de publication <announce-6-0>`__ pour plus de détails et allez au :ref:`téléchargement <download>` pour obtenir une copie.

source: **2011-04-13 - MapServer 6.0.0-beta6 is released**
es: **2011-04-13 - MapServer 6.0.0-beta6 liberado**
fr: **13-04-2011 - MapServer 6.0.0-beta6 est publié**

source: MapServer 6.0.0-beta6 has been released. See `the release announcement <http://lists.osgeo.org/pipermail/mapserver-users/2011-April/068475.html>`__ for more details and head to :ref:`download` to obtain a copy.
fr: MapServer 6.0.0-beta6 vient d'être publié. Voir `l'annonce de publication <http://lists.osgeo.org/pipermail/mapserver-users/2011-April/068475.html>`__ pour plus de détails et allez au :ref:`téléchargement <download>` pour obtenir une copie.

source: **2011-03-15 - MapServer PSC Attend Montreal Code Sprint**
fr: **15-03-2011 - Le Comité de Gouvernance de Projet de Mapserver est présent au code Sprint de Montréal**

source: Members of the MapServer Project Steering Committee attend the `Montreal Code Sprint <http://wiki.osgeo.org/wiki/Montreal_Code_Sprint_2011>`__ event, an international meeting of PostGIS, GDAL, libLAS, GeoPrisma, and MapServer development teams.
fr: Les membres de l'équipe MapServer participent au `Code Sprint de Montréal <http://wiki.osgeo.org/wiki/Montreal_Code_Sprint_2011>`__ , une rencontre internationale des équipes de développement des projets PostGIS, GDAL, libLAS, GeoPrisma et MapServer.

source: **2011-03-09 - MapServer 6.0.0-beta1 is released**
es: **2011-03-09 - MapServer 6.0.0-beta1 liberado**
fr: **09-03-2011 - MapServer 6.0.0-beta1 est publié**

source: MapServer 6.0.0-beta1 has been released. See `the release announcement <http://lists.osgeo.org/pipermail/mapserver-users/2011-March/068125.html>`__ for more details and head to :ref:`download` to obtain a copy.
fr: MapServer 6.0.0-beta1 vient d'être publié. Voir `l'annonce de publication <http://lists.osgeo.org/pipermail/mapserver-users/2011-March/068125.html>`__ pour plus de détails et allez au :ref:`téléchargement <download>` pour obtenir une copie.

source: **2011-01-17 - MapServer 5.6.6 is released**
es: **2011-01-17 - MapServer 5.6.6 liberado**
fr: **17-01-2011 - MapServer 5.6.6 est publié**

source: MapServer 5.6.6 has been released. See `the release announcement <http://lists.osgeo.org/pipermail/mapserver-users/2011-January/067705.html>`__ for more details and head to :ref:`download` to obtain a copy.
fr: MapServer 5.6.6 vient d'être publié. Voir `l'annonce de publication <http://lists.osgeo.org/pipermail/mapserver-users/2011-January/067705.html>`__ pour plus de détails et allez au :ref:`téléchargement <download>` pour obtenir une copie.

source: **2010-07-14 - MapServer 5.6.5 released, fixes a scale calculation issue in 5.6.4**
fr: **14-07-2010 - MapServer 5.6.5 est publié, résolvant un bug de calcul d'échelle introduit dans la version 5.6.4.

source: MapServer 5.6.5 has been released, fixing a scale calculation issue that was introduced in 5.6.4. See the `Announcement <http://lists.osgeo.org/pipermail/mapserver-users/2010-July/066134.html>`__ for more details and head to :ref:`download` to obtain copies.
fr: MapServer 5.6.5 vient d'être publié, résolvant un bug de calcul d'échelle introduit dans la version 5.6.4. Voir `l'annonce de publication <http://lists.osgeo.org/pipermail/mapserver-users/2010-July/066134.html>`__ pour plus de détails et allez à la page de :ref:`téléchargement <download>` pour obtenir une copie.

source: **2010-07-09 - MapServer 5.6.4 and 4.10.6 are released with security fixes**
es: **2010-07-09 - MapServer 5.6.4 y 4.10.6 fueron liberados con correcciones de seguridad**
fr: **09-07-2010 - MapServer 5.6.4 et 4.10.6 sont publiés avec des patchs de sécurité**

source: MapServer 5.6.4 and 4.10.6 have been released, containing important security fixes. See the `Announcement <http://lists.osgeo.org/pipermail/mapserver-users/2010-July/066052.html>`__ for more details and head to :ref:`download` to obtain copies.
fr: MapServer 5.6.4 et 4.10.6 viennent d'être publiés. Voir `l'annonce de publication <http://lists.osgeo.org/pipermail/mapserver-users/2010-July/066052.html>`__ pour plus de détails et allez à la page de :ref:`téléchargement <download>` pour obtenir une copie.

source: **2010-03-22 - MapServer 5.6.3 is released**
es: **2010-03-22 - MapServer 5.6.3 liberado**
fr: **22-03-2010 - MapServer 5.6.3 est publié**

source: MapServer 5.6.3 has been released. See `the release announcement <http://lists.osgeo.org/pipermail/mapserver-users/2010-March/064997.html>`__ for more details and head to :ref:`download` to obtain a copy.
fr: MapServer 5.6.3 vient d'être publié. Voir `l'annonce de publication <http://lists.osgeo.org/pipermail/mapserver-users/2010-March/064997.html>`__ pour plus de détails et allez à la page de :ref:`téléchargement <download>` pour obtenir une copie.

source: **2010-02-20 - MapServer PSC Attend New York Code Sprint**
fr: **20-02-2010 - Le Comité de Gouvernance de Projet de MapServer est présent au code Sprint de New York**

source: Members of the MapServer Project Steering Committee attend the `New York Code Sprint <http://wiki.osgeo.org/wiki/New_York_Code_Sprint_2010>`__ event, an international meeting of PostGIS, GeoServer, GeoMOOSE, and MapServer development teams.
fr: Les membres de l'équipe MapServer participent au `Code Sprint de New York <http://wiki.osgeo.org/wiki/New_York_Code_Sprint_2010>`__ , une rencontre internationale des équipes de développement des projets PostGIS, GeoServer, GeoMOOSE et MapServer.

source: **2010-01-08 - MapServer 5.6.1 is released**
es: **2010-01-08 - MapServer 5.6.1 liberado**
fr: **08-01-2010 - MapServer 5.6.1 est publié**
