Repository: 3x0dv5/docs
Catalog: translated/*/cgi.po
Languages: fr

source: The variable identifies an object uniquely (by name or index in the case of layerObj's and classObj's). The value is a snippet of a mapfile. You cannot create new objects other than inline features at this point.
fr: La variable identifie un objet unique (par son nom ou son index dans le cas de layerObj et de classObj). La valeur est un extrait d'un mapfile. Vous ne pouvez pas créer de nouveaux objets autres que les entités embarquées à ce niveau.

source: Using MapServer version < 5
fr: Utilisation d'une version de MapServer < 5

source: For MapServer version < 5, any value can be expressed using the hierarchy used in a map file. A map contains a layer, which contains a class, which contains a label, which has a color. This hierarchy is expressed as a sequence of MapServer keywords seperated by underscores. For example to change the color of a layer called "lakes" with only one class defined you would use a form variable named "map_lakes_class_color" and could assign it a color like "0 0 255". Layers can be referenced by index (i.e. map_layer_0...) or by name as shown above. Layer classes are referenced by index value (i.e. map_layer_0_class_2). If there is only 1 class for a layer then the index should be ommited. These variables must always begin with the sequence "map\_". Values assigned must conform to the syntax of a map file.
fr: Pour les versions de MapServer < 5, toute valeur peut être exprimée en utilisant la hiérarchie du mapfile. Une carte contient une couche, qui contient une classe, qui contient une étiquette (label), qui a une couleur. Cette hiérarchie est exprimée comme une séquence de mots-clés MapServer séparés par des underscores. Par exemple pour changer la couleur d'une couche nommée "lakes" avec une seule classe définie, vous devriez utiliser une variable de formulaire nommée "map_lakes_class_color" et lui assigner une couleur comme "0 0 255". Les couches peuvent être référencées par un index (par exemple map_layer_0...) ou par un nom comme montré ci-dessus. Les classes de couche sont référencées par une valeur d'index (par exemple map_layer_0_class_2). S'il n'y a qu'une seule classe pour une couche alors l'index devrait être omis. Ces variables doivent toujours commencer par la séquence "map_". Les valeurs assignées doivent être conformes à la syntaxe d'un mapfile.

source: It is also possible to define inline features using this mechanism. This is the only case where you can add on to the map file. You can edit/change layer parameters but you cannot create a new layer. With inline features you have to first create a feature and then build upon it, however, the layer the feature belongs to must exist. Here's a snippet from a GET request that adds a feature to a webuser layer:
fr: Il est également possible de définir des entités embarquées en utilisant ce mécanisme. C'est le seul cas où vous pouvez ajouter quelque chose au mapfile. Vous pouvez éditer/changer les paramètres de la couche mais vous ne pouvez pas créer une nouvelle couche. Avec les entités embarquées vous devez d'abord créer une entité et ensuite construire sur cette ase, cependant, la couche à laquelle appartient l'entité doit exister. Voici un extrait d'une requête GET qui ajoute une entité à une couche utilisateur :

source: The "map_webuser_feature=new" creates a new feature for the webuser layer. All subsequent calls to the feature object for that layer will modify the new feature. You can repeat the process to create additional features. This is really intended for very small (point, rectangle) amounts of data.
fr: Le "map_webuser_feature=new" crée une nouvelle entité pour la couche utilisateur. Tous les appels ultérieurs à cet objet entité pour cette couche modifieront la nouvelle entité. Vous pouvez répéter ce processus pour créer des entités supplémentaires. Ceci reste réellement applicable pour de très petits ensembles de données (point, rectangle).

source: Specifying the location of mapfiles using an Apache variable
fr: Spécification de l'emplacement des mapfiles utilisant une variable Apache

source: Apache variables can be used to specify the location of map files (instead of exposing full mapfile paths to the outside world).
fr: Les variables Apache peuvent être utilisées pour spécifier l'emplacement de fichiers map (plutôt que d'exposer les chemins complets de mapfile au monde extérieur).

source: Set the variable (in this example `MY_MAPFILE`) in Apache's httpd.conf:
fr: Définir la variable (dans cet exemple `MY_MAPFILE`) dans le httpd.conf de Apache:

source: Refer to the variable in the mapserver CGI URL:
fr: Se référer à la variable dans l'URL CGI de MapServer :

source: ROSA-Applet Controls
fr: Contrôles de l'applet ROSA

source: *note: Active development and maintenance of the ROSA Applet has stopped*
fr: *Note : le développement et la maintenance de ROSA ont été stoppés.*

source: The ROSA Applet parameters were added to the CGI MapServer in version 3.6. This Java Applet provides a more intuitive user interface to MapServer. The MapTools site provides detailed information on the ROSA Applet.
fr: Les paramètres de l'applet ROSA ont été ajoutés à MapServer CGI dans la version 3.6. Cette applet Java fournit une interface utilisateur plus intuitive à MapServer. Le site MapTools fournit des informations détaillées sur l'applet ROSA.

source: The parameters can also be used by other interfaces/tools, if set to the right values. Please note that the two parameters have to be handed over to te CGI application in the order identified below.
fr: Les paramètres peuvent également être utilisés par d'autres interfaces et outils s'ils ont les bonnes valeurs. Veuillez noter que les deux paramètres doivent être envoyés à l'application CGI dans l'ordre indiqué ci-dessous.

source: The INPUT_TYPE parameter is needed to identify if the coordinates handed over to the mapserver have to be interpreted as rectangular or point data.
fr: Le paramètre INPUT_TYPE est nécessaire pour identifier si les coordonnées envoyées à MapServer doivent être interprétées comme un rectangle ou une donnée ponctuelle.

source: The ROSA-Applet always fills the pair of coordinates. In case of a point (input_type=auto_point) min and max coordinate are equal (MapServer uses the min value).
fr: L'applet ROSA renseigne toujours la paire de coordonnées. Dans le cas d'un point (input_type=auto_point) les coordonnées min et max sont égales (Mapserver utilise la valeur min).

source: Change map file parameters
fr: Changer les paramètres du mapfile

source: Apache variables
fr: Variables Apache

source: ROSA-Applet controls
fr: Contrôles de l'applet ROSA

source: MapServer CGI Introduction
fr: Introduction au CGI de MapServer

source: Notes
fr: Remarques

source: In cases where multiple values are associated with a variable (eg. mapext), the values must be seperated by spaces (or their escaped equivalents for GET requests).
fr: Dans le cas où plusieurs valeurs sont associées avec une variable (par exemple mapext), les valeurs doivent être séparées par des espaces (ou leur équivalent d'échappement pour les requêtes GET).

source: Variable contents are checked for appropriate data types and magnitude as they are loaded.
fr: Le contenu des variables est vérifié pour les types de données appropriés et leur magnitude au moment de leur chargement.

source: Any CGI Variable not listed below is simply stored and can be referenced within a template file.
fr: N'importe quel variable CGI non listé ci-dessous est simplement stocké et peut être utilisé dans un fichier template.

source: Changes
fr: Changements

source: From MapServer version 4.x to version 5.x
fr: À partir de la version 4.x à la version 5.x de MapServer

source: Modifying map parameters through a URL has changed to allow for chunks of a mapfile to be modified at once. The syntax has changed accordingly, so please see the :ref:`cgi_mapfile_change_parameters` section.
fr: La modification des paramètres de la carte via une URL a été changée pour permettre la modification d'une grosses partie d'un mapfile a être modifié en une fois. La syntaxe a été modifiée en fonction, donc voyez la section :ref:`cgi_mapfile_change_parameters`.

source: From MapServer version 3.x to version 4.x
fr: À partir de la version 3.x à la version 4.x de MapServer

source: New way to perform attribute queries: No longer do you set a layer filter, but rather you pass a query string (and optionally a query item) to the query function. To do this two new CGI parameters were added to MapServer: `QSTRING` and `QITEM`.
fr: Nouvelle manière de réaliser des requêtes attributaires : il n'est plus nécessaire de définir une couche de filtre, mais plutôt passer une chaîne de requête (et en option un objet requête) à la fonction requête. Pour cela deux nouveaux paramètres CGI ont été rajouté à MapServer : QSTRING et QITEM.

source: `SAVEMAP` is switched off: The SAVEMAP functionality is considered insecure, since the saved files are accessible by everyone.
fr: SAVEMAP est à off : La fonctionnalité SAVEMAP est considérée comme non sécurisée, puisque les fichiers sauvés sont accessible par tous le monde.

source: `TEMPLATE` has been removed, since the map_web_template syntax can be used to alter a template file. Simplifies security maintenance by only having to deal with this option in a single place. Note that the `TEMPLATEPATTERN` of the mapfile has to be used to enable this feature.
fr: TEMPLATE a été supprimé puisque la syntaxe map_web_template peut être utilisé pour modifier un fichier template. Simplifie la maintenance de la sécurité en ayant seulement à gérer cette option en un seul endroit. Notez que le TEMPLATEPATTERN du mapfile doit être utilisé pour activer cette fonctionnalité.

source: Map Context Files
fr: Fichiers de Contexte de Carte

source: Support for Local Map Context Files
fr: Gestion des fichiers de contexte de carte locale

source: There is a CGI parameter called CONTEXT that is used to specify a local context file. The user can then use MapServer to request a map using the following syntax:
fr: Il y a un paramètre CGI appellé CONTEXT qui est utilisé pour définir un fichier contexte local. L'utilisateur peut alors utiliser MapServer pour demander une carte en utilisant la syntaxe suivante :

source: All layers created from a context file have their status set to ON. To be able to display layers, the user needs to add the LAYERS argument in the URL.
fr: Toutes les couches crées à partir du fichier contexte ont leur status à ON. Pour afficher des couches, l'utilisateur doit ajouter l'argument LAYERS dans l'URL.

source: Support for Context Files Accessed Through a URL
fr: Gestion de fichier de contexte accédé par une URL

source: The syntax of using a web accessible context file would be similar to accessing a local context file:
fr: La syntaxe pour utiliser un fichier de contexte accessible par le web devrait être similaire à l'accès d'un fichier de contexte local.

source: Due to security concerns loading a file from a URL is disabled by default. To enable this functionality, the user needs to set a CONFIG parameter called CGI_CONTEXT_URL in the default map file that will allow this functionality. Here is an example of a map file with the CONFIG parameter:
fr: En raison de problèmes de sécurité, le chargement de fichier à partir d'une URL est désactivé par défaut. Pour activer cette fonctionnalité, l'utilisateur doit définir un paramètre CONFIG appelé CGI_CONTEXT_URL dans le fichier map par défaut qui permettra cette fonctionnalité. Voici un exemple d'un fichier map avec le paramètre CONFIG :

source: Default Map File
fr: Fichier Map par défaut

source: To smoothly run a MapServer CGI application with a Map Context, the application administrator needs to provide a default map file with at least the basic required parameters that will be used with the Context file. This default map file can contain as little information as the imagepath and imageurl or contain a list of layers. Information coming from the context (e.g.: layers, width, height, â€¦) would either be appended or will replace values found in the map file.
fr: Pour exécuter une application avec le CGI de MapServer en douceur avec un contexte de carte, l'application de l'administrateur doit fournir un fichier map par défaut avec au moins les paramètres de base nécessaires qui seront utilisés avec le fichier de contexte. Ce fichier map par défaut peut contenir aussi peu d'informations que ImagePath et ImageUrl ou contenir une liste de couches. Les informations provenant du contexte (Par exemple : couches, largeur, hauteur, etc.) seront soit ajoutées ou remplaceront les valeurs trouvées dans le fichier de la carte.

source: Here is an example of a default map file containing the minimum required parameters:
fr: Voici un exemple d'un fichier map par défaut contenant les paramètres minimales obligatoire :

source: The CGI interface can be tested at the commandline by using the "QUERY_STRING" switch, such as:
fr: L'interface CGI peut être testée en ligne de commande en utilisant le commutateur "QUERY_STRING", comme suivant:

source: To suppress the HTTP headers, you can use the "-nh" switch, such as:
fr: Pour supprimer les en-têtes HTTP, vous pouvez utiliser le commutateur "-nh", comme suivant:

source: To save the output into an image file, use the pipe command such as:
fr: Pour sauver le résultat dans un fichier image, utilisez la commande de redirection comme suivant:

source: MapServer OpenLayers Viewer
fr: Visualisateur OpenLayers de MapServer

source: MapServer provides a simple, built-in method for testing a mapfile using OpenLayers. This feature is for testing/development purposes only, and not for production or deploying full-featured sites. You can preview, test, and navigate a mapfile by accessing a special url which will return a built-in OpenLayers template.
fr: MapServer fournit un méthode simple, déjà incluse pour tester un mapfile en utilisant OpenLayers. Cette fonctionnalité a seulement un but de test/développement, et pas d'usage en production ou pour déployer des sites avec des fonctionnalités complètes. Vous pouvez prévisualiser, tester, et naviguer dans un mapfile en accédant à une URL spéciale qui retournera un modèle avec OpenLayers intégré.

source: This feature was discussed in `rfc 63 <http://mapserver.org/development/rfc/ms-rfc-63.html>`_ and in the ticket https://github.com/mapserver/mapserver/issues/3549
fr: Cette fonctionnalité a été discutée dans `rfc 63 <http://mapserver.org/development/rfc/ms-rfc-63.html>`_ ainsi que dans le ticket suivant https://github.com/mapserver/mapserver/issues/3549

source: Using the OpenLayers viewer
fr: Utilisation du visualisateur OpenLayers

source: Opening the OpenLayers viewer in your browser
fr: Ouvrir le visualisateur OpenLayers dans votre navigateur

source: Assuming you are running mapserver on your local machine, and you have the Itasca demo setup, a basic url would be (split into two lines for readability)::
fr: En assumant que vous avez MapServer sur votre machine locale, et que vous avez la démo Itasca configurée, une url basique serait (découpée en deux lignes pour plus de lisibilité)

source: Here is a quick breakdown of that url:
fr: Voici une rapide décomposition de cette URL:

source: Basic Parameters for activating the OpenLayers browser::
fr: Paramètres basiques pour activer le visualisateur OpenLayers

source: Basic Map / Layer Parameters::
fr: Paramètres carte /couche basiques::

source: **That's it!**
fr: **C'est cela !**

source: Opening the OpenLayers viewer in the form of a WMS request
fr: Ouvrir le visualisateur OpenLayers sous la forme d'une requête WMS

source: This feature is useful when debugging WMS requests. You can write one of these by hand, or copy the URL for a WMS tile. Running the following should give you a simple OpenLayers demo around the BBOX (split into several lines for readability)::
fr: Cette fonctionnalité est très utile quand vous débuggez des requêtes WMS. Vous pouvez écrire une de ces requêtes à la main, ou copier l'URL pour une tuile WMS. Lancer ce qui suit devrait vous donner une démo OpenLayers simple autour de la BBOX (découpée en plusieurs lignes pour plus de lisibilité)::

source: Here is a quick breakdown of the interesting parts of that URL:
fr: Voici une rapide décomposition des parties intéressantes de cette URL :

source: Special Parameter for activating the OpenLayers viewer::
fr: Paramètre spécial pour activer le visualisateur OpenLayers ::

source: Basic MapServer Parameters::
fr: Paramètres basiques de MapServer ::

source: Basic WMS parameters::
fr: Paramètres WMS basiques ::

source: Customizing settings
fr: Customiser les paramètres

source: environment variables::
fr: variables d'environnement::

source: Run-time Substitution
fr: Substitution à la volée

source: Table of Contents
fr: Table des matières

source: Run-time substitution for the MapServer CGI has been around since version 4.0 and it's use has continued to expand. In short, it allows you to alter portions of a mapfile based on data passed via a CGI request.
fr: La substitution à la volée pour le MapServer CGI a été mise en place depuis la version 4.0 et son utilisation a continué à se développer. En bref, elle vous permet de modifier des parties d'un mapfile basée sur les données transmises via une requête CGI. Cette fonctionnalité est uniquement disponible via l'application standard CGI.

source: Case sensitivity
fr: Sensible à la casse

source: Since version 6.4, CGI parameter names are not case sensitive. CGI parameter values are case sensitive.
fr: Depuis la version 6.4, les noms des paramètres CGI sont insensibles à la casse. Les valeurs des paramètres CGI sont eux sensibles à la casse.

source: Basic Example
fr: Exemple basique

source: Let's say you'd like the user to dynamically set a portion of an expression so they could highlight a certain land cover class, and you have a form element (called ctype) that allows them to choose between: forest, water, wetland and developed.
fr: Disons que vous souhaitez que l'utilisateur définisse dynamiquement une partie d'une expression pour qu'ils puissent mettre en évidence une certaine classe d'occupation des sols, et vous avez un formulaire (appelé ctype) qui leur permettent de choisir entre : forêts, eau, zones humides et développées. Vous pouvez ensuite

source: A request should look like (assuming "marsh" is a valid land cover class)::
fr: Une requête doit ressembler à ceci (en supposant que "marsh" est une classe valide pour land cover) ::

source: You could then set up a layer like so:
fr: Vous pouvez alors configurer une couche de cette manière :

source: When a request is processed, the value for ctype is substituted for the string %ctype% and the mapfile is processed as normal. If no ctype is passed in, the EXPRESSION will never be true so it doesn't really hurt anything except for a slight performance hit. Often you would set a default class to draw features that don't match, but that is not required.
fr: Quand une requête est traitée la valeur pour ctype est remplacé par la chaîne %Ctype% et le mapfile est traitée comme d'habitude. Si aucun ctype n'est passé dans EXPRESSION celle-ci ne sera jamais vraie par conséquent cela ne posera pas de problème sauf une petite baisse de performance. Souvent, vous devrez définir une classe par défaut pour dessiner les géométries qui ne correspondent pas, mais ce n'est pas obligatoire.

source: Parameters Supported
fr: Paramètres gérés

source: Not every mapfile parameter supports run-time substitution and care has been taken to try and support those that make the most sense. All parameters `must` be validated. Remember, you also can do run-time configuration using the map_object_property type syntax detailed in :ref:`cgi_mapfile_change_parameters`. Below is a list of properties that do allow run-time substitution:
fr: Tous les paramètres du mapfile ne sont pas gérés pour la substitution à la volée et une attention a été portée pour essayer de gérer ceux qui font le plus de sens. N'oubliez pas que vous pouvez aussi configurer à la volée en utilisant la syntaxe du type map_object_property détaillée dans :ref:`cgi_mapfile_change_parameters`. Voici une liste des propriétés dont la substitution à la volée est permise :

source: OUTPUTFORMAT: FORMATOPTION: FILENAME (must have a `MAP` `VALIDATION` pattern)
fr: OUTPUTFORMAT: FORMATOPTION: FILENAME (doit avoir un pattern au niveau de la `VALIDATION` dans `MAP`)

source: OUTPUTFORMAT: all FORMATOPTIONs
fr: OUTPUTFORMAT: tous les FORMATOPTIONs

source: MAP->WEB: METADATA (values only, not keys)
fr: MAP->WEB: METADATA (les valeurs seulement, pas les clés)

source: FILTERs
fr: FILTER

source: You can use runtime substitutions to change values within a FILTER as you go. For example your FILTER could be written like so::
fr: Vous pouvez utiliser des substitutions à la volée pour modifier des valeurs dans un FILTER. Par exemple, votre objet FILTER peut être écrit comme ceci::

source: Then (assuming you're using the CGI interface) you could pass in variables named multimedia, nseats and sound with values defined by the user in an HTML form.
fr: Puis (en supposant que vous utilisez l'interface CGI), vous pourrez passer des variables nommées multimedia, nseats et le sound avec des valeurs définies par l'utilisateur dans un formulaire HTML.

source: You should also define validation expressions on these variables to guard against unintentional SQL being submitted to postgis (since version 6.0, validation is mandatory). Within the layer you'd do the following:
fr: Vous devez également définir des expressions de validation sur ces variables pour prévenir contre la soumission involontaire de requête SQL à PostGIS (depuis la version 6.0, la validation est obligatoire). A l'intérieur de la couche, vous ferez comme suivant :

source: The validation strings are regular expressions that are applied against the appropriate variable value before being added to the FILTER. The first two limit the value of multimedia and sound to yes or no. The third limits the value for nseats to a 2 digit integer.
fr: Les chaînes de validation sont des expressions régulières qui sont appliquées sur les valeurs de la variable appropriée avant d'être ajoutée au filtre. Les deux premiers limitent la valeur de multimedia et de sounds à oui ou non. La troisième limite la valeur pour nseats à un nombre entier à 2 chiffres.

source: Default values if not provided in the URL
fr: Valeurs par défaut si non fournies dans l'URL

source: The runtime substitution mechanism will usually create syntactically incorrect, and almost always semantically incorrect mapfiles if the substitution parameter was not provided in the calling URL.
fr: Le mécanisme de substitution à la volée créera toujours des mapfiles incorrect au niveau de la syntaxe et presque toujours au niveau sématique si le paramètre de substitution n'a pas été fournie dans l'url.

source: Since version 5.6, you can provide a default value for any substitution parameter, that will be applied if the parameter was not found in the url. You do this by providing special entries inside :ref:`CLASS`, :ref:`LAYER` or :ref:`WEB` validation blocks:
fr: Depuis la version 5.6, vous pouvez fournir une valeur par défaut pour n'importe quel paramètre de substitution qui sera appliqué si le paramètre n'était pas trouvé dans l’URL. Vous pouvez réaliser cela en fournissant des entrées spéciales dans les blocs de validation de :ref:`CLASS`, :ref:`LAYER` ou :ref:`WEB` :

source: In this example, the mapfile will be created as if the url contained "&sound=yes&nseats=5&multimedia=yes".
fr: Dans cet exemple, le mapfile sera créé comme si l'url contenait "&sound=yes&nseats=5&multimedia=yes".
