Repository: 3x0dv5/docs
Catalog: translated/*/cgi.po
Languages: fr

source: MapServer CGI Controls
fr: Contrôles CGI pour MapServer

source: Variable names are not case sensitive.
fr: Les noms de variable ne sont pas sensible à la casse.

source: A distance, in the same coordinate system as the map file, used in conjunction with MAPXY to create an new map extent.
fr: Une distance, dans le même système de coordonnées que le mapfile, utilisée en conjonction avec MAPXY pour créer une nouvelle étendue de carte.

source: The name of a :ref:`LAYER` CLASSGROUP. Set the :ref:`LAYER` `CLASSGROUP` to `name` for all layers that have at least one :ref:`CLASS` that is using the given CLASSGROUP `name`.
fr: Le nom de la CLASSGROUP de l'objet :ref:`LAYER`. Définit le nom de la `CLASSGROUP` de l'objet :ref:`LAYER` à `name` pour toutes les couches qui ont au moins une ref:`CLASS` qui utilise le `name` de la CLASSGROUP donnée

source: CONTEXT [filename]
fr: CONTEXT [nom_fichier]

source: Path to a context file. Path is relative to the map file to be used, or can also be a URL path (See the section "Map Context Support Through CGI" below for more details).
fr: Chemin vers un fichier contexte. Le chemin est relatif au mapfile à utiliser ou peut être également un chemin URL (voir la section "Gestion du Web Map Context (WMC) via CGI" plus bas dans ce document pour plus de détails).

source: ICON [layername],[classindex]
fr: ICON [nom_couche],[index_classe]

source: Used in MODE=legendicon to generate a legend icon for a layer. The class index value is optional and defaults to 0.
fr: Utilisé avec MODE=legendicon pour générer une icône de légende pour une couche. La valeur classindex est optionnelle et vaut 0 par défaut.

source: ID [id-string]
fr: ID [id-chaine]

source: By default MapServer generates a uniq session id based on system time and process id. This parameter overwrites the default.
fr: Par défaut MapServer génère un identifiant unique de session basé sur l'heure du système et l'identifiant du processus. Ce paramètre remplace la valeur par défaut.

source: The name associated with the inline map image used to record user clicks. What actually is passed are two variables, img.x and img.y.
fr: Le nom associé à l'image de la carte embarquée est utilisé pour enregistrer les clics de l'utilisateur. Ce sont deux variables img.x et img.y qui sont passées.

source: For the CGI Applications this is an essential variable, see the examples for sample usage.
fr: Pour les applications CGI c'est une variable essentielle, regardez les exemples pour son utilisation.

source: Coordinates (in pixels) of a box drag in the image. Most often used in conjunction with Java based front ends to the MapServer.
fr: Coordonnées (en pixels) du cadre dessiné dans l'image. La plupart du temps utilisé en conjonction avec un frontend Java pour MapServer.

source: The spatial extent of the existing inline image, that is, the image the users can see in their browser.
fr: L'étendue spatiale de l'image embarquée existante que les utilisateurs peuvent visualiser dans leur navigateur.

source: An arbitrary polygon shape (specified using **image coordinates**) to be used for query purposes.
fr: Un polygone arbitraire (spécifié en utilisant les **coordonnées image**) à utiliser pour les requêtes.

source: The polygon is specified by listing its coordinates (multiple instances simply add parts to the shape so it is possible to construct a shape with holes) or by specifying the WKT (Well Known Text) representation.
fr: Le polygone est spécifié en listant des coordonnées (plusieurs instances peuvent simplement additionner des éléments d'un Shape, il est donc possible de construire un Shape avec des trous) ou en spécifiant la représentation WKT (Well Known Text)

source: Used with the NQUERY mode.
fr: Utilisé avec les modes NQUERY.

source: IMGSIZE [cols] [rows]
fr: IMGSIZE [colonnes] [lignes]

source: The size (in pixels) of the exiting inline image.
fr: La taille (en pixels) de l'image embarquée existante.

source: Coordinates (in pixels) of a single mouse click. Used most often in conjunction with Java based front ends to the MapServer.
fr: Coordonnées (en pixels) d'un simple clic de souris. Utilisé le plus souvent en conjonction avec un frontend Java pour MapServer.

source: LAYER [name]
fr: LAYER [nom]

source: The name of a layer as it appears in the map file. Sending mapserv a layer name sets that layer's STATUS to ON.
fr: Le nom d'une couche tel qu'il apparaît dans le fichier map. Envoie à mapserv le nom d'une couche dont le paramètre STATUS passera à ON.

source: LAYERS [name name ...]
fr: LAYERS [nom nom ...]

source: The names of the layers to be turned on. Layer names must be seperated by spaces.
fr: Les noms des couches à activer. Les noms des couches doivent être séparés par des espaces.

source: Version 4.4 and above: passing 'LAYERS=all' will automatically turn on all layers.
fr: Dans les versions 4.4 et supérieures : 'LAYERS=all' activera automatiquement toutes les couches.

source: MAP [filename]
fr: MAP [nom_fichier]

source: Path, relative to the CGI directory, of the map file to be used.
fr: Chemin, relatif au répertoire CGI, du fichier map à utiliser.

source: MAPEXT [minx] [miny] [maxx] [maxy] , MAPEXT (shape)
fr: MAPEXT [minx] [miny] [maxx] [maxy] , MAPEXT (forme)

source: The spatial extent of the map to be created.
fr: L'étendue spatiale de la carte à créer.

source: Can be set to shape as an alternative option. In this case mapextent is set to the extent of a selected shape. Used with queries.
fr: Peut être renseignée avec "shape" comme option alternative. Dans ce cas MAPEXT sera défini par l'étendue du Shape sélectionné. À utiliser avec des requêtes.

source: An arbitrary polygon shape (specified using **map coordinates**) to be used for query purposes.
fr: Un polygone arbitraire (spécifié en utilisant les **coordonnées image**) à utiliser pour les requêtes.

source: The polygon is specified by listing its coordinates (multiple instances simply add parts to the shape so it is possible to construct a shape with holes) or by specifying a WKT (Well Known Text) representation of the polygon.
fr: Le polygone est spécifié en listant des coordonnées (plusieurs instances peuvent simplement additionner des éléments d'un Shape, il est donc possible de construire un Shape avec des trous) ou en spécifiant une représentation WKT (Well Known Text)

source: MAPSIZE [cols] [rows]
fr: MAPSIZE [colonnes] [lignes]

source: The size (in pixels) of the image to be created. Useful for allowing users to change the resolution of the output map dynamically.
fr: La taille (en pixels) de l'image à créer. Particulièrement utile pour permettre aux utilisateurs de changer dynamiquement la résolution de la carte de sortie.

source: MAPXY [x] [y] , MAPXY (shape)
fr: MAPXY [x] [y] , MAPXY (forme)

source: A point, in the same coordinate system as the shapefiles, to be used in conjuction with a buffer or a scale to construct a map extent.
fr: Un point, dans le même système de coordonnées que les fichiers Shape, à utiliser en conjonction avec un tampon (buffer) ou une échelle pour construire une étendue de carte.

source: MINX | MINY | MAXX | MAXY [number]
fr: MINX | MINY | MAXX | MAXY [nombre]

source: Minimum/Maximum x/y coordinate of the spatial extent for a new map/query. This set of parameters are the pieces of MAPEXT.
fr: Coordonnées x/y minimales/maximales de l'étendue spatiale pour une nouvelle carte/requête. Ces paramètres sont des éléments de MAPEXT.

source: MODE [value]
fr: MODE [valeur]

source: Mode of operation. The following options are supported:
fr: Mode d'opération. Les options suivantes sont gérées :

source: Fully interactive interface where maps (and interactive pages) are created. This is the default mode.
fr: Interface totalement interactive dans laquelle les cartes (et les pages interactives) sont créées. Ceci est le mode par défaut.

source: A spatial search that uses multiple features from SLAYER to query other layers.
fr: Une recherche spatiale qui utilise plusieurs entités de SLAYER pour interroger les autres couches.

source: A spatial search that uses one feature from SLAYER to query other layers.
fr: Une recherche spatiale qui utilise une entité de SLAYER pour interroger les autres couches.

source: Looks up a feature based on the values of SHAPEINDEX and TILEINDEX parameters. SHAPEINDEX is required, TILEINDEX is optional and is only used with tiled shapefile layers.
fr: Consulte une entité basée sur les valeurs des paramètres SHAPEINDEX et TILEINDEX. SHAPEINDEX est obligatoire, TILEINDEX est optionnel et est utilisé seulement avec les couches shapefile assemblées.

source: A text search of attribute data is triggered using a QSTRING. Returns all matches. Layer to be searched is defined using slayer parameter. The results of this search are applied to other searchable layers (which can be limited using the QLAYER parameter).
fr: Une recherche textuelle dans les données attributaires est déclenchée par un QSTRING. Retourne toutes les correspondances. La couche à chercher est définie en utilisant le paramètre slayer. Les résultats de cette recherche sont appliqués aux autres couches interrogeables (qui peuvent être limitées en utilisant le paramètre QLAYER).

source: A text search of attribute data is triggered using a QSTRING. Returns first match. Layer to be searched is defined using slayer parameter. The results of this search are applied to other searchable layers (which can be limited using the QLAYER parameter).
fr: Une recherche textuelle dans les données attributaires est déclenchée par un QSTRING. Retourne la première correspondance. La couche cherchée est définie en utilisant le paramètre slayer. Les résultats de cette recherche sont appliqués aux autres couches interrogeables (qui peuvent être limitées en utilisant le paramètre QLAYER).

source: A text search of attribute data is triggered using a QSTRING. Returns all matches.
fr: Une recherche textuelle dans les données attributaires est déclenchée en utilisant un QTRING. Retourne toutes les correspondances.

source: A text search of attribute data is triggered using a layer QSTRING. Returns 1st match.
fr: Une recherche textuelle dans les données attributaires est déclenchée en utilisant une couche QTRING. Retourne la première correspondance.

source: The created legend is returned. Used within an <img ... > tag.
fr: La légende créée est retournée. Utilisé avec une balise <img ... >.

source: A legend icon is returned. The ICON parameter must also be used to specify the layername and a class index. Class index value is optional and defaults to 0. For example:
fr: Une icône de légende est retournée. Le paramètre ICON peut également être utilisé pour spécifier le nom de la couhe et un index de classe. La valeur de l'index de classe est optionnelle et vaut 0 par défaut. Par exemple :

source: The created map is returned. Used within an <img ... > tag.
fr: La carte créée est retournée. Utilisé avec une balise <img ... >.

source: A spatial search (finds all) is triggered by a click in a map or by user-define selection box.
fr: Une recherche spatiale (trouve tout) est déclenchée par un clic sur une carte ou par un cadre de sélection défini par l'utilisateur.

source: A spatial search (finds closest) is triggered by a click in a map.
fr: Une recherche spatiale (trouve le plus proche) est déclenchée par un clic sur une carte.

source: The created reference map is returned. Used within an <img ... > tag.
fr: La carte de référence créée est retournée. Utilisé avec une balise <img ... >.

source: The created scalebar is returned. Used within an <img ... > tag.
fr: L'échelle créée est retournée. Utilisé avec une balise <img ... >.

source: Switch to mode BROWSE with ZOOMDIR=1
fr: Modifie le mode de navigation (BROWSE) avec ZOOMDIR=1.

source: Switch to mode BROWSE with ZOOMDIR=-1
fr: Modifie le mode de navigation (BROWSE) avec ZOOMDIR=-1.

source: To be clarified.
fr: À clarifier.

source: The previously available map-only query modes, e.g. ITEMQUERYMAP, are no longer supported. The `QFORMAT` parameter is now used instead.
fr: Les modes d'interrogation de type "map" antérieurement disponibles, c'est à dire ITEMQUERYMAP, ne sont plus maitenant supportés. Le paramètre `QFORMAT` est maintenant utilisé à la place.

source: QFORMAT [outputformat | mime/type] (optional)
fr: QFORMAT [format_sortie | mime/type] (optionnel)

source: The `OUTPUTFORMAT` name or mime/type to be used to process a set of query results (corresponds to the :ref:`WEB` object's QUERYFORMAT parameter). The parameter is optional and used in conjunction with query `MODE`\s. The default is text/html.
fr: Le format `OUTPUTFORMAT` ou le mime/type à utiliser pour traiter un jeu de résultats de requête (correspond au paramètre QUERYFORMAT de l'objet :ref:`WEB`). Le paramètre est optionnel et utilisé en conjonction avec les `MODE`\s de requête. La valeur par défaut est text/html.

source: Example (map output):
fr: Exemple (carte en sortie) :

source: QITEM [name] (optional)
fr: QITEM [nom] (optionnel)

source: The name of an attribute in a layer attribute table to query on. The parameter is optional and used in conjunction with the QSTRING for attribute queries.
fr: Le nom d'un attribut dans la table attributaire d'une couche à interroger. Le paramètre est optionnel et est utilisé en conjonction avec QSTRING pour les requêtes attributaires.

source: QLAYER [name]
fr: QLAYER [nom]

source: Query layer. The name of the layer to be queried as it appears in the map file.
fr: Interrogation de couche. Le nom de la couche qui doit être interrogée tel qu'il apparaît dans le mapfile.

source: Attribute queries: Query string passed to the query function. Since 5.0, qstring will have to be specified in the `VALIDATION` parameter of the `LAYER` for qstring queries to work (*qstring_validation_pattern* `LAYER`-level `METADATA` for MapServer versions prior to 5.4).
fr: Requêtes d'attribut: chaîne de requête passée à la fonction de requête. Depuis la version 5.0, qstring devra être spécifié dans le paramètre `VALIDATION` de la `LAYER` pour les requêtes qstring fonctionnent (*qstring_validation_pattern* `METADATA` au niveau de `LAYER` pour les versions de MapServer avant 5.4).

source: QUERYFILE [filename]
fr: QUERYFILE [nom_fichier]

source: Used with BROWSE or NQUERY mode. This option identifies a query file to load before any regular processing. In BROWSE mode this result in a query map being produced instead of a regular map. This is useful when you want to hilite a feature while still in a pan/zoom mode. In NQUERY mode you'd gain access to any of the templates used in normally presenting the query, so you have access to query maps AND attribute information. See the SAVEQUERY option.
fr: Utilisé avec les modes BROWSE ou NQUERY. Cette option identifie un fichier requête à charger avant tout processus régulier. Dans le mode BROWSE cela produit une carte requise à la place d'une carte normale. Ceci est utile quand vous voulez mettre en évidence une entité lors d'un changement de zoom (mode pan/zoom). Dans le mode NQUERY vous obtenez l'accès à l'un des modèles utilisés normalement dans la présentation de la requête, ainsi vous avez accès aux cartes requises ET aux informations attributaires. Voyez l'option SAVEQUERY.

source: The name associated with the inline reference map image used to record user clicks. What actually is passed are two variables, ref.x and ref.y.
fr: Le nom associé à l'image embarquée de la carte de référence utilisé pour enregistrer les clics de l'utilisateur. Deux variables sont passées, ref.x et ref.y.

source: For the CGI Applications this is an essential variable when reference maps are used, see the examples for sample usage.
fr: Pour les applications CGI ce sont des variables essentielles quand les cartes de référence sont utilisées, voyez les exemples.

source: Coordinates (in pixels) of a single mouse click in the reference image. Used in conjunction with Java based front ends to the MapServer.
fr: Coordonnées (en pixels) d'un simple clic de souris sur l'image de référence. Utilisé en conjonction avec une frontend Java pour MapServer.

source: When used with any of the query modes this tells the MapServer to save the query results to a temporary file for use in subsequent operations (see QUERYFILE). Useful for making queries persistent.
fr: Échelle pour créer une nouvelle carte. L'échelle donnée est le dénominateur de la fraction de l'échelle réelle, par exemple pour une carte d'échelle 1:24000, utilisez 24000. Implémenté dans MapServer 5.0 pour remplacer le paramètre obsolète SCALE.

source: SCALEDENOM [number]
fr: SCALEDENOM [nombre]

source: Scale to create a new map at. Used with mapxy. Scale is given as the denominator of the actual scale fraction, for example for a map at a scale of 1:24,000 use 24000. Implemented in MapServer 5.0, to replace the deprecated SCALE parameter.
fr: Échelle pour créer une nouvelle carte. L'échelle donnée est le dénominateur de la fraction de l'échelle réelle, par exemple pour une carte d'échelle 1:24000, utilisez 24000. Implémenté dans MapServer 5.0 pour remplacer le paramètre obsolète SCALE.

source: SCALE [number] - deprecated
fr: SCALE [nombre] - déprécié

source: Since MapServer 5.0 the proper parameter to use is SCALEDENOM instead. The deprecated SCALE is the scale to create a new map at. Used with mapxy. Scale is given as the denominator of the actual scale fraction, for example for a map at a scale of 1:24,000 use 24000.
fr: Depuis MapServer 5.0 le bon paramètre à utiliser est SCALEDENOM à la place de SCALE. Ce paramètre obsolète est l'échelle à laquelle créer une nouvelle carte. Utilisé avec MAPXY. L'échelle donnée est le dénominateur de la fraction de l'échelle réelle, par exemple pour une carte d'échelle 1:24000, utilisez 24000.

source: It is possible to do pan/zoom interfaces using querymaps. In these cases you will likey want information about the contents of the new map rather than the previous map which is the normal way queries work. When searchmap is specified the new map is created and it's extent is used to query layers. Useful with NQUERY mode only.
fr: Il est possible de créer des interfaces pour gérer le zoom (pan/zoom) en utilisant des querymaps. Dans ces cas, vous aimerez avoir l'information sur les contenus de la nouvelle carte plutôt que celle de la précédente carte ce qui est la façon normale de fonctionnement des requêtes. Quand SEARCHMAP est spécifié la nouvelle carte est créée et son étendue est utilisée pour les couches de requêtes. Très utile avec le mode NQUERY uniquement.

source: Used for index queries (in conjunction with INDEXQUERY).
fr: Utilisé pour indexer les requêtes (en combinaison avec INDEXQUERY).

source: SLAYER [name]
fr: SLAYER [nom]

source: Select layer. The name of the layer to be used for any of the feature (i.e. staged) query modes. The select layer must be a polygon layer. The selection feature(s) are available for presentation to the user.
fr: Couche de sélection. Le nom de la couche devant être utilisé pour l'une des fonctions de recherche sur l'entité (par exemple STAGED). La couche sélectionnée doit être une couche de polygones. La ou les entités sélectionnées sont disponibles pour être présentées à l'utilisateur.

source: Used for index queries (in conjunction with INDEXQUERY), used with tiled shapefile layers.
fr: Utilisé pour indexer les requêtes (en combinaison avec INDEXQUERY), utilisé avec les couches de Shape assemblés (tiled shapefiles).

source: ZOOM [number]
fr: ZOOM [nombre]

source: Zoom scaling to apply to the creation of the new map. Values greater than 0 resulting in zooming in, 0 is a pan, and values less than zero are for zooming out. A value of 2 means "zoom in twice".
fr: Echelle de zoom à appliquer lors de la création d'une nouvelle carte. Les valeurs supérieures à 0 indiquent un agrandissement (zoom in), 0 pour la vue d'ensemble (pan), et les valeurs négatives indiquent un rétrécissement (zoom out). Une valeur de 2 indique un "agrandissement par deux".

source: ZOOM can be used as a shortcut for the combination ZOOMDIR/ZOOMSIZE. The zoom is limited by the MINZOOM/MAXZOOM settings compiled into the MapServer (-25/25) by default.
fr: ZOOM peut être utilisé comme un raccourci de la combinaison ZOOMDIR/ZOOMSIZE. Le zoom est limité par le paramètre MINZOOM/MAXZOOM compilé dans MapServer (-25/25) par défaut.

source: Direction to zoom. See above.
fr: Direction du zoom. Voir ci-dessus.

source: ZOOMSIZE [number]
fr: ZOOMSIZE [nombre]

source: Absolute magnitude of a zoom. Used with ZOOMDIR.
fr: Grandeur absolue d'un zoom. Utilisé avec ZOOMDIR.

source: ZOOMDIR is limited to MAXZOOM compiled into the MapServer (25 by default).
fr: ZOOMDIR est limité par MAXZOOM compilé dans MapServer (25 par défaut).

source: Changing map file parameters via a form or a URL
fr: Modifier les paramètres du fichier map à l'aide d'un formulaire ou d'une URL

source: Beginning with version 3.3 it is possible to change virtually any map file value from a form or a URL (see :ref:`RUNSUB`). The syntax for this is fairly straightforward, and depends on what version of MapServer you are using. One potentially very powerful use of this ability to change mapfile parameters through a URL involves changing class expressions on-the-fly. `VALIDATION` is used to control run-time substition. Try it out.
fr: À partir de la version 3.3 il est possible de changer virtuellement toute valeur du mapfile via un formulaire ou une URL (voir :ref:`RUNSUB`). La syntaxe pour cela est assez simple et dépend de la version de MapServer que vous utilisez. Une utilisation potentielle très puissante de cette capacité à changer les paramètres du mapfile via une URL implique un changement, à la volée, des expressions de classe. `VALIDATION` est utilisé pour contrôler la substition à la volée. Essayer cette fonctionnalité..

source: This functionality is only available via the :ref:`mapserv` CGI application. Within MapScript this is easy to do by yourself since the developer has complete control over how input is handled.
fr: Cette fonctionnalité est seulement disponible via l'application CGI :ref:`mapserv`. A l'aide de MapScript, il est facile de le faire par soi-même comme le développeur a un contrôle total sur la manière dont l'entrée est gérée.

source: Using MapServer version >= 5
fr: Utilisation d'une version de MapServer >= 5

source: Previous versions of the MapServer CGI program allowed certain parameters to be changed via a URL using a cumbersome syntax such as map_layer_0_class_0_color=255+0+0 which changes the color in one classObj. So, in the past you had to change parameters one-at-a-time. Now you can pass chunks of mapfiles (with security restrictions) to the CGI interface. The map_object notation is still necessary to identify which object you want to modify but you can change multiple properties at one time. Note that you can use either a '_' or a '.' to seperate identifiers.
fr: Les versions précédentes du programme MapServer CGI permettaient de changer certains paramètres via une URL en utilisant une syntaxe lourd

source: Example 1, changing a scalebar object:
fr: Exemple 1, changement de l'objet scalebar :

source: Example 2, changing a presentation style:
fr: Exemple 2, changement du style de présentation :

source: Example 3, creating a new feature:
fr: Exemple 3, création d'une nouvelle entité :

source: Example 4, set multiple web object parameters:
fr: Exemple 4, définition des paramètres de plusieurs objets web :

source: Example 5, set the map size:
fr: Exemple 5, définition de la taille de la carte :
