Repository: 3x0dv5/docs
Catalog: translated/*/cgi.po
Languages: fr

source: If identical default keys appear in more than one validation block then keys in more specialised blocks override those in more generalised blocks. i.e. `CLASS` overrides `LAYER` which overrides `WEB`. The same functionality is available using `METADATA` blocks instead of `VALIDATION` but this is deprecated as of MapServer 5.4.0. This behavior is also accessible in the shp2img utility, allowing you to test runtime substitution mapfiles without using a webserver.
fr: Si des clés par défaut identiques apparaissent dans plus d'un bloc de validation, alors les clés dans les blocs plus spécialisés surchargeront ceux qui sont dans les blocs plus généralistes c'est à dire que `CLASS` aura priorité sur `LAYER` qui aura lui-même priorité sur `WEB`. La même fonctionnalité est disponible en utilisant les blocs `METADATA` à la place de `VALIDATION` mais c'est déprécié avec MapServer 5.4.0. Ce comportement est également accessible dans l'utilitaire shp2img, vous permettant de tester les mapfiles avec substitution à la volée sans l'aide d'un serveur web.

source: Because runtime substitution affects potentially sensitive areas of your mapfile, such as database columns and filenames, it is mandatory that you use pattern validation (since version 6.0)
fr: Comme la substitution à la volée affecte potentiellement des zones sensibles de votre mapfile, comme les colonnes et les noms de base de données, il est obligatoire d'utiliser une validation par pattern (depuis la version 6.0)

source: Pattern validation uses regular expressions, which are strings that describe how to compare strings to patterns. The exact functionality of your systems' regular expressions may vary, but you can find a lot of general information by a Google search for "regular expression tutorial".
fr: La validation par pattern utilise les expressions régulières, qui sont des chaînes qui décrivent comment comparer des chaînes de caractères avec des patterns. La même fonctionnalité d'expressions régulières de votre système est susceptible de varier, mais vous pouvez trouver un grand nombre d'informations génrales en effectuant une recherche Google avec "tutoriel expressions régulières".

source: As of MapServer 5.4.0 the preferred mechanism is a `VALIDATION` block in the `LAYER` definition. This is only slightly different from the older `METADATA` mechanism. `VALIDATION` blocks can be used with :ref:`CLASS`, :ref:`LAYER` and :ref:`WEB`.
fr: Depuis MapServer 5.4.0, le mécanisme à préférer est le bloc de `VALIDATION` dans la définition `LAYER`. Cela ne diffère que légèrement du vieux mécanisme avec `METADATA`. Les blocs de `VALIDATION` peuvent être utilisés avec :ref:`CLASS`, :ref:`LAYER` et :ref:`WEB`.

source: If identical keys appear in more than one validation block then keys in more specialised blocks override those in more generalised blocks. i.e. `CLASS` overrides `LAYER` which overrides `WEB`.
fr: Si des clés identiques apparaissent dans plus d'un bloc de validation, alors les clés dans les blocs plus spécialisés surchargeront ceux qui sont dans les blocs plus généralistes, c'est à dire que `CLASS` aura priorité sur `LAYER` qui aura lui-même priorité sur `WEB`.

source: Magic values
fr: Valeurs magiques

source: Some runtime substitutions have special caveats.
fr: Certaines substitutions à la volée ont des avertissements spéciaux.

source: In addition to any defined `METADATA` or `VALIDATION`, the 'id' parameter will be subjected to a special check. It must be alphanumeric and cannot be longer than 63 characters.
fr: En plus de la définition de n'importe quel `METADATA` ou `VALIDATION`, le paramètre 'id' sera sujet à une vérification spéciale. Il doit être alphanumérique et ne peut pas dépasser en longueur 63 caractères.

source: Run-time substitution
fr: Substitution à la volée

source: Supported parameters
fr: Paramètres supportés

source: Default value
fr: Valeur par défaut

source: A Simple CGI Wrapper Script
fr: Un simple script de wrapper CGI

source: This document presents a simple shell script that can be used to "wrap" the MapServer CGI, in order to avoid having to specify the 'map' parameter (or any other chosen parameters) in your MapServer URLs.
fr: Ce document présente un script shell simple qui peut être utilisé pour "wrapper" le CGI de MapServer dans le but d'éviter d'avoir à spécifier le paramètre "map" (ou n'importe quels autres paramètres) dans l'URL de votre MapServer.

source: Using a wrapper script is inefficient as it implies spawing two processes (shell+mapserv) instead of only one (mapserv), and should not be used on production installations. Refer to :ref:`online_resource_wms` for examples of how to setup similar functionality directly by using webserver configuration options.
fr: Utiliser un script wrapper est inefficace comme il implique l'exécution de deux processus (shell+mapserv) plutôt q'un seul (mapserv) et ne devrait pas être utilisé en production. Se réfèrer à :ref:`online_resource_wms` pour des exemples sur comment configurer un fonctionnalité similaire en utilisant directement les options de configuration du serveur web.

source: Script Information
fr: Information sur le script

source: If you want to avoid having to specify the 'map' parameter in your MapServer URLs, one solution is to use a "wrapper". Basically, a wrapper is a CGI program that receives an incoming CGI request, modifies the request parameters in some way, and then hands off the actual processing to another CGI program (e.g. MapServer).
fr: Si vous désirez éviter à avoir à spécifier le paramètre 'map' dans vos URL de MapServer, une solution est d'utiliser un "wrapper". Typiquement un wrapper est un programme CGI qui reçoit une requête CGI en entrée, modifie les paramètres de la requête puis renvoie le processus vers un autre programme CGI (par exemple MapServer).

source: The following shell scripts are wrappers for CGI GET requests that should be generic enough to run on any OS with /bin/sh.
fr: Le script suivant est un wrapper pour les requêtes GET CGI qui doit être assez générique pour être lancé à partir de n'importe quel Système d'Exploitation avec /bin/sh:

source: You should set the MAPSERV and MS_MAPFILE variables as appropriate for your configuration. MAPSERV points to your MapServer executable, and MS_MAPFILE points to the mapfile you want MapServer to use. Both variables should be absolute file paths that your webserver has permission to access, although they need not (and probably should not) be in web-accessible locations. Put the script in your web server's cgi-bin directory, and make it executable.
fr: Vous devez définir les variables MAPSERV et MS_MAPFILE comme appropriées pour votre configuration. MAPSERV pointe vers votre éxécutable MapServer, et MS_MAPFILE pointe vers le mapfile que vous voulez que MapServer utilise. Les deux variables doivent être des chemins de fichiers absolus dans lesquels votre serveur web a un accès en lecture, bien qu'ils ne nécessitent pas (et probablement ne devrait pas) être des endroits accessibles par le web. Puis placez le script dans votre répertoire cgi-bin du serveur, et rendez-le exécutable.

source: This solution should support both GET and POST requests.
fr: Cette solution devrait fonctionner à la fois pour les requêtes GET et POST

source: You should set the MAPSERV and MAPFILE variables as appropriate for your configuration. MAPSERV points to your MapServer executable, and MAPFILE points to the mapfile you want MapServer to use. Both variables should be absolute file paths that your webserver has permission to access, although they need not (and probably should not) be in web-accessible locations. Then put the script in your web server's cgi-bin directory, and make it executable.
fr: Vous devez définir les variables MAPSERV et MAPFILE comme appropriés pour votre configuration. MAPSERV pointe vers votre éxécutable MapServer, et MAPFILE pointe vers le mapfile que vous voulez que MapServer utilise. Les deux variables doivent être des chemins de fichiers absolue dans lesquels votre serveur web a un accès en lecture, bien que ils ne nécessitent pas (et probablement ne devrait pas) être des endroits accessibles par le web. Puis placez le script dans votre répertoire cgi-bin du serveur, et rendez le exécutable.

source: Although this script only sets the 'map' parameter, it is easily modified to set any number of other MapServer parameters as well. For example, if you want to force your MapServer to 'map' mode, you can simply add 'mode=map' to the front of the QUERY_STRING variable. Just remember to separate your parameters with ampersands ('&').
fr: Bien que ce script définisse le paramètre 'map', il est facile de le modifier pour définir n'importe quels autres paramètres MapServer. Par exemple, si vous voulez forcer le mode de votre MapServer à 'map' vous pouvez simplement ajouter 'mode=map' au début de la variable QUERY_STRING. Souvenez-vous de séparer vos paramètres avec une esperluette('&').

source: Finally, note that the script only works for GET requests.
fr: Enfin, remarquez que ce script ne fonctionne qu'avec les requêtes GET.
