Repository: 3x0dv5/docs
Catalog: translated/*/copyright.po
Languages: id, sq

source: License
id: Lisensi
sq: Licensa

source: Copyright (c) 1996-2008 Regents of the University of Minnesota.
sq: Drejta e Autorit (c) 1996-2008 Regents e Universitetit të Minesotës.

source: Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
id: Dengan ini diizinkan, bebas biaya, pada pihak manapun untuk mendapat salinan perangkat lunak dan berkas dokumentasi yang terkait (selanjutnya disebut "Software"), untuk menggunakan Software tanpa batasan apapun, termasuk tanpa batasan hak untuk menggunakan, menyalin kembali, mengubah, menggabungkan, mendistribusikan, membuat sub-lisensi, dan/atau menjual salinan Software, dan juga untuk mengizinkan pihak lain untuk melakukan hal tadi, dengan persyaratan sebagai berikut:
sq: Leja është dhënë me anë të kësaj, pa pagesë, për personin i cili merr një kopje të këtij software dhe dokumentat të lidhura ( "Software"), për t'u marrë me Programin, pa kufizim, duke përfshirë pa kufizim të drejtat për të përdorur, kopjuar, modifikuar, shkrihen , të botojë, shpërndajë, nënlicensa, dhe/ose të shesin kopje të Programit, dhe të lejojë personat, të cilit i është mobiluar Programit për ta bërë këtë, në varësi të kushteve të mëposhtme:

source: The above copyright notice and this permission notice shall be included in all copies of this Software or works derived from this Software.
sq: Njoftimi mbi të drejtën e autorit dhe kjo leje njoftimi, do të përfshihen në të gjitha kopjet e këtij Programi ose punëve që rrjedhin nga kjo Program.

source: THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
sq: PROGRAM OFROHET "SIQ ËSHTË", PA ASNJË LLOJ GARANCIE, TË SHPREHUR APO TË NËNKUPTUAR, DUKE PËRFSHIRË POR PA U KUFIZUAR TE GARANCITË E SHITJES, PËRDORIMIT PËR NJË QËLLIM TË CAKTUAR DHE JO-FREGMENTIMIT. NË ASNJË RAST AUTORËVE APO MBAJTËSVE TË AUTORIT TË JETË PËRGJEGJËS PËR NDONJË PRETENDIM, DËMET OSE NDONJË DETYRIM TJETËR, QOFTË NË NJË VEPRIM TË KONTRATËS, KRIMIT APO NDRYSHE, QË DALIN NGA, APO NË LIDHJE ME PROGRAMIN OSE PËRDORIMIN OSE MARRËDHËNIET E TJERA NË PROGRAM.

source: Credits
id: Kredit
sq: Nderime

source: Major funding for the development of MapServer has been provided by NASA through cooperative agreements with the University of Minnesota, Department of Forest Resources. Additional enhancements have been made by the State of Minnesota, Department of Natural Resources and the Land Management Information Center. We would like to acknowledge other major contributions as well:
id: Pendanaan utama pengembangan MapServer disediakan oleh NASA melalui perjanjian kerja sama dengan Department of Forest Resources, University of Minnesota. Peningkatan tambahan dilakukan oleh Pemerintah Negara Bagian Minnesota lewat Department of Natural Resources dan Land Management Information Center. Dan berikut ini adalah kontributor utama lainnya:
sq: Financimi i madh për zhvillimin e MapServer është siguruar nga NASA përmes marrëveshjeve bashkëpunimi me Universitetin e Minesotës, Departamenti i Burimeve Pyjore. Përmirësime të tjera janë bërë nga shteti i Minesotës, Departamenti i Burimeve Natyrore dhe Qendra e Informacionit të Menaxhimit të Tokës. Ne do të donim të pranojmë kontributet e tjera të mëdha, si dhe:

source: MapServer and MapScript have been developed by Stephen Lime.
id: MapServer dan MapScript dikembangkan oleh Stephen Lime.
sq: MapServer dhe MapScript janë zhvilluar nga Stephen limonit.

source: Raster access module developed by Pete Olson and Stephen Lime.
id: Modul akses raster dikembangkan oleh Pete Olsen dan Stephen Lime.
sq: Moduli Raster është zhvilluar nga Pete Olson dhe Stephen limonit.

source: PHP/MapScript module was developed by `DM Solutions`_ and is maintained by `MapGears`_.
id: Modul PHP/MapScript dikembangkan oleh `DM Solutions`_ dan dikelola oleh `MapGears`_.
sq: Moduli PHP/MapScript është zhvilluar nga `DM Solutions`_ dhe mirëmbahet nga `MapGears`_.

source: Portions copyright (c) 1998 State of Minnesota, Land Management Information Center.
id: Sebagian hak cipta (c) 1998 State of Minnesota, Land Management Information Center.
sq: Pjesë të të Drejtës së Autorit (c) 1998 Shteti e Minesotës, Toka Qendra e Informacionit të Menaxhimit.

source: Ongoing maintenance and support frequently provided by the US Army Corps of Engineers
id: Pemeliharaan berjalan dan dukungan disediakan oleh US Army Corps of Engineers
sq: Mirëmbajtje e vazhdueshme dhe mbështetje e dhënë shpesh nga Korpusit të Inxhinierëve të Ushtrisë të SHBA

source: Several version 6.2 features funded through Météo-France
id: Beberapa fitur versi 6.2 didanai oleh Météo-France
sq: Disa version 6.2 Karakteristika të financuara përmes Meteo-Francë
