Repository: 3x0dv5/docs
Catalog: translated/*/errors.po
Languages: fr, zh

source: Errors
fr: Erreurs
zh: 错误

source: drawEPP(): EPPL7 support is not available
zh: 不支持：绘制 EPP(): EPPL7

source: Error displayed when not using EPPL7 data.
fr: Erreur affichée quand on n'utilise pas des données EPPL7
zh: 不使用 EPPL7 数据时，错误显示

source: This is a confusing error for users who are not even trying to view EPPL7 layers (EPPL7 is a raster format). The full error displayed may appear as follows:
fr: C'est une erreur qui peut être source de confusion pour les utilisateurs qui ne cherchent même pas à voir des couches EPPL7 (EPPL7 est un format raster). L'erreur complète affichée pourrait apparaître comme suivant:
zh: 对于没有尝试查看 EPPL7 图层 (EPPL7 是一种栅格数据格式) 的用户，这是一个令人困惑的错误。完整的错误可能会显示如下：

source: Explanation
fr: Explication
zh: 解释

source: When MapServer tries to draw a layer, it will attempt to use all of the drivers it knows about, and the EPPL7 driver is the very last driver it will try. This means that if a layer fails to draw for any reason, you will see this error message.
fr: Quand MapServer essaye de dessiner une couche, il va tenter d'utiliser tous les pilotes qu'il connaît, et le pilote EPPL7 est le dernier pilote qui sera essayé. Cela signifie que si une couche n'arrive pas à être dessinée pour n'importe quelle raison, vous verrez ce message d'erreur.
zh: 当 MapServer 尝试绘制一个图层，程序会企图使用所有它所知道的驱动程序。EPPL7 驱动是最后一个被尝试的驱动，这意味着如果一个图层由于任何原因无法被绘制， 您将会看到这条错误信息。

source: There are other possible instances when this error can appear however, here are a few:
fr: Il y a d'autres cas possibles où cette erreur peut apparaître cependant, en voici quelques-unes:
zh: 还有其他的情况会使这条错误信息出现，例如：

source: the server is returning either a ServiceException (which MapServer does not yet detect and parse into a reasonable error message) or it is returning an image in an unrecognized format ... for instance it is returning a GIF image and MapServer is not built to support GIF images.
fr: le serveur retourne une erreur de type ServiceException (que MapServerne détecte pas encore et parse en renvoyant un message d'erreur raisonnable) ou il retourne une image dans un format no reconnu ... Par exemple, il retourne une image GIF et MapServer n'a pas été compilé pour supporter les images GIF.
zh: 服务器正在返回一个服务异常 (这时MapServer还没有探测以及解析获得一个有意义的错误信息) 或者返回一个无法读取的图像 ... 例如一个GIF 图像，而 MapServer 并不支持 GIF 图像。

source: WMS servers often advertise multiple image formats but don't respect them in the getmap request.
fr: Les serveur WMS peuvent souvent indiquer plusieurs formats d'image mais ne pas les respecter dans la requête getmap.
zh: WMS 服务器经常为多种图像格式做广告，但它本身在地图获取请求中并不遵守它们

source: loadLayer(): Unknown identifier. Maximum number of classes reached
zh: loadLayer(): 未知标识符。类的数量已到达最大极限

source: Error displayed when attempting to draw a layer with a large number of classes.
fr: Erreur affichée quand on tente de dessiner une couche avec un grand nombre de classes
zh: 当试图绘制包含大量类别的图层时错误出现。

source: This error states that MapServer has reached its limit for the maximum number of classes for the layer. This maximum can be modified in the MapServer source, and can then be re-compiled. *map.h* contains the default values, and below are the defaults for MapServer 4.10 and 4.8:
fr: Cette erreur indique que MapServer a atteint ses limites pour le nombre maximum de classes pour la couche. Ce maximum peut être modifié dans les sources MapServer, et peut être ensuite re-compilé. *map.h* contient les valeurs par défaut, et en dessous voici les valeurs par défaut pour MapServer 4.10 et 4.8:
zh: 这个错误声明 MapServer 中图层的类的数量已到达最大最大上限。这个最大值可以在 MapServer 资源中更改，然后可以被重新编译。*map.h* 包含默认值，以下是MapServer 4.10 以及 4.8的一些默认参数：

source: This limitation was corrected in MapServer 5.0 and should no longer be a problem.
fr: Cette limitation a été corrigée dans MapServer 5.0 et ne devrait plus être un problème.
zh: 这个限制在 MapServer 5.0 已经被更正且应该不再是一个问题。

source: loadMapInternal(): Given map extent is invalid
zh: loadMapInternal(): 所提供地图范围无效

source: When loading your mapfile or one of your layers, MapServer complains about an invalid extent.
fr: Quand vous charger votre mapfile ou l'une de vos couches, MapServer se plaint d'une étendue invalide.
zh: 在读取一个地图文件或者一个图层时，MapServer 显示无效地图范围。

source: Beginning in MapServer 4.6, MapServer got more strict about LAYER and MAP extents. If minx is greater than maxx, or miny is greater than maxy, this error will be generated. Check your MAP's EXTENT, LAYER's EXTENT, or wms_extent setting to make sure this is not the case. MapServer **always** takes in extents in the form of:
fr: A partir de MapServer 4.6, MapServer devient plus strict sur les étendues des LAYER et de MAP. Si le minx iest plus grand que le maxx, ou que miny est plus grand que maxy, cette erreur sera générée. Vérifiez votre EXTENT de MAP, celui des LAYER, ou le paramètre wms_extent pour s'assurer que ce n'est pas le cas. MapServer prend **toujours** les étendues sous la forme de:
zh: 从 MapServer 4.6 开始，MapServer 对于图层以及地图的范围更加严格。如果minx （最小x值）大于 maxx （最大x值），或者miny （最小y值）大于 maxy （最大y值），将会生成这个错误。请检查你的地图范围，图层范围或者wms_extent（wms范围）设置以确定不存在以上错误。MapServer **总是** 接受一下格式的范围：

source: How to get a file's EXTENT values?
fr: Comment obtenir les valeurs de l'EXTENT d'un fichier?
zh: 如何获得一个文件的范围值？

source: The easiest way to get a vector file's EXTENT is to use the `ogrinfo`_ utility, that is part of the GDAL/OGR library (for raster files you would use the `gdalinfo`_ utility). Windows users can download the `FWTools`_ package, which includes all of the GDAL and OGR commandline utilities. `MS4W`_ also includes the utilities (in *ms4w/tools/gdal-ogr-utils/*). Linux users will probably already have the GDAL libraries, if not you can also use the `FWTools` package.
fr: La manière la plus simple d'avoir l'EXTENT d'un fichier vecteur est d'utiliser la commande `ogrinfo`_ , qui fait partie de la bibliothèque GDAL/OGR (pour les fichiers raster vous devriez utiliser la commande `gdalinfo`_). Les utilisateurs Windows peuvent télécharger le logiciel `FWTools`_ qui inclut tous les utilitaires en ligne de commande de GDAL et OGR. `MS4W`_ inclut aussi des utilitaires (dans *ms4w/tools/gdal-ogr-utils/*). Les utilisateurs Linux users auront probablement déjà la bibliothèque GDAL, si ce n'est pas le cas, vous pouvez aussi utiliser le logiciel `FWTools`.
zh: 最简便的方式是获取一个矢量文件的范围以用于`ogrinfo`_ 应用 （栅格文件使用 `gdalinfo`_ 应用），这是 GDAL/OGR 库中的一部分。Windows 用户可以下载包含所有 GDAL 和 OGR 命令行应用的 `FWTools`_ 工具包。`MS4W`_ 也包括这些应用（见*ms4w/tools/gdal-ogr-utils/*）。Linux 用户可能已经有GDAL库，如果没有您也可以使用 `FWTools`_ 工具包。

source: For example, here is the results of the ogrinfo command on a shapefile (notice the "Extent" line):
fr: Par exemple, voici les résultats de la commande ogrinfo qur un shapefile (Notez la ligne "Extent"):
zh: 例如，这里是使用对一个shapefile 使用 oginfo 命令的结果 （注意“范围”边界）：

source: Ogrinfo gives the file's extent in the form of (minx, miny),(maxx, maxy), therefore the EXTENT in a mapfile would be:
fr: Ogrinfo donne l'étendue du fichier sous la forme (minx, miny),(maxx, maxy), par conséquent l'EXTENT dans le mapfile devrait être:
zh: Ogrinfo 使用 (minx, miny),(maxx, maxy) 格式对文件范围赋值，因此一个地图文件的范围值会是：

source: The EXTENT in a mapfile must be in the same units as the :ref:`MAP` -level :ref:`PROJECTION`.
fr: L'EXTENT dans le mapfile doit être dans la même unité la :ref:`PROJECTION` du niveau :ref:`MAP`.
zh: 一个地图文件的范围值必须与:ref:`MAP` 层次 :ref:`投影` 具有同样的单位。

source: msGetLabelSize(): Requested font not found
zh: msGetLabelSize(): 未找到所请求字体

source: Error displayed when attempting to display a specific font.
fr: Erreur affichée quand on tente d'afficher une police spécifique
zh: 错误在尝试显示某种特殊字体时出现。

source: This message tells you that MapServer cannot find specified font.
fr: Ce message vous dit que Mapserver ne peut pas trouver la police spécifiée
zh: 这条信息告诉您 MapServer 无法找到指定的字体。

source: :ref:`FONTSET`
zh: :ref:`字体设置`

source: msLoadFontset(): Error opening fontset
zh: msLoadFontset(): 打开字体设置时出现错误

source: Error when attempting to display a label.
fr: Erreur quand on tente d'afficher une étiquette
zh: 在尝试显示一个标签时出现错误。

source: This message tells you that MapServer cannot find the :ref:`FONTSET` specified in the :ref:`mapfile`.
fr: Ce message indique que MapServer ne peut pas trouver le :ref:`FONTSET` spécifié dans le :ref:`mapfile`.
zh: 这条信息告诉您 MapServer 无法找到 :ref:`地图文件` 中的 :ref:`字体设置`。

source: msLoadMap(): Failed to open map file
zh: msLoadMap(): 无法打开地图文件

source: Error displayed when trying to display map image.
fr: Erreur affichée quand on essaye d'affiche une image de carte
zh: 错误在尝试显示地图图像时出现。

source: The message tells you that MapServer cannot find map file or has problems with the map file. Verify that you have specified the correct path to the mapfile. Linux/Unix users should make sure that the web user has access permissions to the mapfile path as well. Verify that the map file using shp2img to make sure that the syntax is correct.
fr: Le message vous dit que MapServer ne peut pas trouver le fichier .map ou a des problèmes avec le fichier .map. Vérifiez que vous avez spécifié le chemin correct vers le mapfile. Les utilisateurs Linux/Unix devraient s'assurer que l'utilisateur web a les droits d'accès au chemin du mapfile également. Vérifier le fichier .map en utilisant shp2img pour être sûr que la syntaxe est correcte.
zh: 这条信息告诉你 MapServer 无法地图文件或者地图文件存在问题。请确认你是否指定了正确的文件路径。Linux/Unix 用户应确定网络用户也具有访问地图文件路径的权限。请确认地图文件使用 shp2img 以确定语法正确。

source: The error message states where MapServer thinks the mapfile is:
fr: Le message d'erreur indique où MapServer pense que le mapfile est:
zh: 错误信息指示 MapServer 所认为的地图文件路径为：

source: msProcessProjection(): no options found in 'init' file
zh: msProcessProjection(): 在 'init' 文件中没有找到选项

source: Error displayed when attempting to use a specific projection.
fr: Erreur affichée quand on tente d'utiliser une projection donnée.
zh: 错误在尝试显示指定地图投影时出现。

source: The message tells you that the projection you're trying to use isn't defined in the epsg file. Open your epsg file in a text editor and search for your projection to make sure that it exists.
fr: Le message vous dit que la projection que vous essayez d'utiliser n'est pas dans le fichier epsg. Ouvrez votre fichier epsg dans un éditeur de texte et recherchez votre projection pour vous assurez qu'elle existe.
zh: 这条信息提示你所尝试使用的投影在 epsg 文件中没有被定义。请在记事本编辑器中打开你的 epsg 文件并搜索你的投影以确定它的存在。

source: On Windows, the default location of the epsg file is *c:\\proj\\nad*. MS4W users will find the epsg file in *\\ms4w\\proj\\nad*.
fr: Sous Windows, l'emplacement par défaut du fichier epsg est *c:\\proj\\nad*. Les utilisateurs de MS4W trouveront le fichier epsg dans *\\ms4w\\proj\\nad*.
zh: 在 Windows 系统中, 默认的 epsg 文件路径为： *c:\\proj\\nad*. MS4W 用户可以在 *\\ms4w\\proj\\nad* 找到 epsg 文件。

source: :ref:`PROJECTION` and http://spatialreference.org
zh: :ref:`投影` 与 http://spatialreference.org

source: msProcessProjection(): No such file or directory
zh: msProcessProjection(): 不存在该文件或目录

source: Error displayed when trying to refer to an epsg file.
fr: Erreur affichée quand on essaye de fair référence à un fichier epsg
zh: 错误在尝试访问一个 epsg 文件时出现。

source: The message tells you that MapServer cannot find the epsg file.
fr: Le message vous dit que MapServer ne peut pas trouver le fichier epsg.
zh: 这条信息告诉您 MapServer 无法找到指定的 epsg 文件。

source: Linux/Unix users should be careful to **specify the correct case** when referring to the epsg file, since filenames are case sensitive on Linux/Unix. "init=epsg:4326" refers to the epsg filename, and therefore "init=EPSG:4326" will not work because it will be looking for an *EPSG* file in uppercase.
fr: Les utilisateurs Linux/Unix devraient faire attention à **spécifier le chemin correct** quand vous vous référez au fichier epsg, comme les fichiers sont sensibles à la casse sous Linux/Unix. "init=epsg:4326" fait référence au nom de fichier epsg, et par conséquent "init=EPSG:4326" ne fonctionnera pas parce que Mapserver cherche un nom de fichier *EPSG* en majuscules.
zh: 由于文件名在 Linux/Unix 系统中区别大小写，Linux/Unix 用户需要注意在访问 epsg 文件时 **指定正确的大小写** 。如 "init=epsg:4326" 为 epsg 文件名，使用 "init=EPSG:4326" 将无法访问该文件，因为系统会查找一个大写的 *EPSG* 文件。

source: Setting the location of the epsg file
fr: Paramétrer l'emplacement du fichier epsg
zh: 设置 epsg 文件位置

source: There are a few options available if you need to set the epsg location:
fr: Il y a quelques options disponibles si vous avez besoin de définir l'emplacement du fichier epsg:
zh: 如果您需要设置 epsg 文件位置，有几个选项可供选择：

source: Use a system variable ("environment variable" on windows) called "PROJ_LIB" and point it to your epsg directory.
fr: Utiliser une variable système ("variable d'environnement" sous windows) appelée "PROJ_LIB" et la faire pointer vers votre répertoire epsg.
zh: 使用一个名为“PROJ_LIB”的系统变量 (在 windows 中为“环境变量”)并使其指向您的 epsg 路径。

source: Use the mapfile parameter CONFIG to force the location of the epsg file. This parameter is specified at the MAP level
fr: Utiliser le paramètre de CONFIG pour forcer l'emplacement du fichier epsg. Ce paramètre est spécifié au niveau MAP
zh: 使用地图文件参数 CONFIG 以固定 epsg 文件位置。该变量在 MAP 层次中被定义

source: :ref:`mapfile`
zh: :ref:`地图文件`

source: Set an environment variable through your web server. Apache has a SetEnv directive that can set environment variables. Add something like the following to your Apache *httpd.conf* file:
fr: Définir une variable d'environnement par l'intermédiaire du serveur web. Apache a une directive SetEnv qui peut définir des variables d'environnement. Ajouter quelque chose ressemblant à ce qui suit dans votre fichier *httpd.conf* Apache:
zh: 通过您的网络服务器设置一个环境变量。Apache（Web服务器）有一个 SetEnv 指令可以设置环境变量。在您的Apache *httpd.conf* 文件中添加类似以下例子的内容：

source: msProcessProjection(): Projection library error.major axis or radius = 0 not given
zh: msProcessProjection(): 投影库错误。主坐标或半径 = 0 未定义

source: Error displayed when attempting to specify projection parameters.
fr: Erreur affichée quand tente de spécifier les paramètres de projection.
zh: 错误在尝试指定投影参数时出现。

source: Since MapServer 4.0, you are required to specify the ellipsoid for the projection. Omitting this ellipsoid parameter in later MapServer versions will cause this error.
fr: Depuis MapServer 4.0, il est obligatoire de spécifier l'ellipsoïde pour la projection. Omettre le paramètre ellipsoïde dans les versions récentes de MapServer causera cette erreur.
zh: 自 MapServer 4.0 开始，你需要为地图投影制定地球椭球。遗漏该椭球参数在此后的 MapServer 版本中会导致错误。

source: Valid Examples
fr: Exemples valides
zh: 有效例子

source: 4.0 and newer:
fr: 4.0 et plus récente:
zh: 4.0 及更新版本:

source: before MapServer 4.0:
fr: avant Mapserver 4.0
zh: 早于 MapServer 4.0：

source: msQueryByPoint: search returned no results
zh: msQueryByPoint: 没有结果从搜索返回

source: Why do I get the message "msQueryByPoint(): Search returned no results. No matching record(s) found" when I query a feature known to exists?
fr: Pourquoi j'obtiens le message "msQueryByPoint(): Search returned no results. No matching record(s) found" quand j'interroge un objet dont je sais qu'il existe?
zh: 为什么我在检索一个已知存在的要素时得到消息 "msQueryByPoint(): 没有结果从搜索返回。没有找到符合条件的记录"

source: The query feature requires a TEMPLATE object in the CLASS object of your LAYER definition. The value points to a html fragment using MapServer template syntax.
fr: L'interrogation d'une objet nécessite un objet TEMPLATE dans l'objet CLASS pour la définition de votre LAYER. La valeur pointe vers un fragment html qui utilise la syntaxe de template MapServer.
zh: 要素检索在您的图层定义的类中要求一个范本实体。这个值使用 MapServer 的范本语法指向一个 html 碎片。

source: Example MapFile fragment:
fr: Fragment de Mapfile exemple
zh: 地图文件碎片示例：

source: Example Template:
fr: Template exemple:
zh: 范本示例：

source: The [lrn] is a special keyword that indicates the resulting line number which starts at 1. [PIN] is the name of a feature attribute.
fr: Le [lrn] est un mot-clé spécial qui indique le numéro de la ligne résultante qui commence à 1. [PIN] est le nom de l'attribut de l'objet.
zh: [lrn] 是一个标志着结果线编号从 1 开始的特殊的关键词， [PIN] 是一个要素属性的名称。

source: msReturnPage(): Web application error. Malformed template name
zh: msReturnPage(): 网页应用程序错误。畸形范本名

source: This error may occur when you are attempting to use a URL template for a query. The issue is that URL templates are only allowed for query modes that return only one result (e.g. query or itemquery)
fr: Cette erreur peut se produire quand vouz tentez d'utiliser un template URL pour une requête. Le problème est que les templates URL ne sont permis que pour les modes d'interrogation qui retourne un seul résultat (comme query ou itemquery)
zh: 该错误在你尝试在一次检索中使用一个 URL 范本时出现。URL 范本只允许在返回单一结果的检索模式 (例如检索或项目检索)中使用

source: You can only use a URL template for a query in mode=query or mode=itemquery. If you try it with mode=nquery or mode=itemnquery, you will get the error:
fr: Vous pouvez seulement utiliser un template URL pour une interrogation en mode=query ou mode=itemquery. si vous essayez avec mode=nquery ou mode=itemnquery, vous obtiendrez cette erreur:
zh: 你只能在 模式=检索 或 模式=项目检索 时对一个检索使用URL 范本。如果你尝试在 模式=n检索 或 模式=项目n检索 时使用 URL 范本，你将会得到以下错误：

source: msSaveImageGD(): Unable to access file
zh: msSaveImageGD(): 无法访问文件

source: Error displayed when attempting to display map image.
fr: Erreur affichée quand on tente d'afficher une image de carte.
zh: 错误在尝试显示地图图像时出现。

source: This error is displayed if MapServer cannot display the map image. There are several things to check:
fr: Cette erreur est affichée si Mapserver ne peut pas afficher l'image de carte. Il y a différentes choses à vérifier:
zh: 该错误在 MapServer 无法显示地图图像时出现。您需要检查一下几项：

source: IMAGEPATH and IMAGEURL parameters in mapfile are valid
fr: Les paramètres IMAGEPATH et IMAGEURL dans le mapfile sont valides
zh: 地图文件中的 IMAGEPATH 与 IMAGEURL 参数是有效的

source: In CGI mode, any IMAGEPATH and IMAGEURL variables set in the init pages are valid
fr: En mode CGI, n'importe quelles variables IMAGEPATH et IMAGEURL définies dans les pages d'initialisation sont valides
zh: 在 CGI 模式中，初始页面中的任何 IMAGEPATH 与 IMAGEURL 变量设置是有效的

source: Linux/Unix users should verify that the web user has permissions to write to the IMAGEPATH
fr: Les utilisateurs Linux/Unix devraient vérifier que l'utilisateur web a les droits d'écriture sur IMAGEPATH
zh: Linux/Unix 用户需要确认网络用户具有写入 IMAGEPATH 的权限

source: msWMSLoadGetMapParams(): WMS server error. Image Size out of range, WIDTH and HEIGHT must be between 1 and 2048 pixels
zh: msWMSLoadGetMapParams(): WMS 服务器错误。图像大小超出范围。宽度与高度必须在 1 到 2048 像素之间

source: Error that is returned / displayed when a user has requested a map image (via WMS) that exceeds the maximum width or height that the service allows.
fr: Erreur qui retourne/affiche quand un utilisateur a interrogé un image de carte (via WMS) qui dépasse la largeur ou la hauteur que le service autorise
zh: 错误在用户 (通过WMS) 请求一个超出服务允许的最大高度或宽度的地图图像时被返回/显示。

source: To increase the maximum map width and height for the service, use the MAXSIZE parameter of the :ref:`MAP` object. Producing larger map images requires more processing power and more memory, so take care.
fr: Pour augmenter la largeur et la hauteur maximum de la carte pour le service, utilisez le paramètre MAXSIZE de l'objet :ref:`MAP`. Produire des images de carte plus grandes nécessite plus de puissance de traitements et plus de mémoire, ainsi faites attention.
zh: 使用 :ref:`地图` 的 最大尺寸 参数为服务增大最大地图宽度与高度。请注意：处理更大的地图图像需要更多的处理功耗与内存。

source: One of the dll-s could not be loaded that mapscript.dll depends on.
fr: Une des dll dont mapscript.dll dépend n'a pas pu être chargée.
zh: 一个或更多 mapscript.dll 依赖的动态链接库无法加载

source: You can get this problem on Windows and in most cases it can be dedicated to a missing or an unloadable shared library. The error message talks about mapscript.dll but surely one or more of the dll-s are missing that libmap.dll depends on. So firstly you might want to check for the dependencies of your libmap.dll in your application directory. You can use the Visual Studio Dependency Walker to accomplish this task. You can also use a file monitoring tool (like SysInternal's filemon) to detect the dll-s that could not be loaded. I propose to store all of the dll-s required by your application in the application folder. If you can run the mapscript sample applications properly your compilation might be correct and all of the dlls are available.
fr: Vous pouvez avoir ce problème sous Windows et dans la plupart des cas, il peut dû à une bibliothèque partagée manquante ou impossible à charger. Le message d'erreur parle de mapscript.dll mais il manque surement une ou plusieurs dll-s dont libmap.dll dépend. Ainsi en premier, vous devriez vérifier les dépendances de votre libmap.dll dans votre répertoire d'application. Vous pouvez utiliser le logiciel Visual Studio Dependency Walker pour accomplir cette tâche. Vous pouvez aussi utiliser un outil de monitoring de fichiers (comme filemon fourni par SysInternal) pour détecter les dll-s qui ne peuvent pas être chargées. Je propose de stocker toutes les dll-s requises par votre application dans votre répertoire d'application. Si vous pouvez lancer les applications exemples exemples mapscript correctement, votre compilation devrait être correcte et toutes vos dlls seraient disponibles.
zh: 您可以会在 Windows 中获得这个问题。在很多情况下，这源于一个丢失或无法加载的共享库。错误信息提到 mapscript.dll，但可以确定一个或多 libmap.dll 依赖的动态链接库丢失。所以首先您可能需要检查您的应用路径中 libmap.dll 的依赖对象。您可以使用 Visual Studio Dependency Walker 来完成这个任务。您也可以使用一个文件监控工具 (像SysInternal's filemon) 来监测无法加载的动态链接库。我建议在应用程序文件夹中存放所有您的应用程序所需要的动态链接库文件。如果您可以运行mapscript 的示例程序，你的编译应该是正确的，且所有的动态链接库文件可用。

source: C#-specific information
fr: Information spécifique à C#
zh: C#-特殊信息

source: You may find that the mapscript C# interface behaves differently for the desktop and the ASP.NET applications. Although you can run the drawmap sample correctly you may encounter the dll loading problem with the ASP.NET applications. When creating an ASP.NET project your application folder will be '\Inetpub\wwwroot\[YourApp]\bin' by default. The host process of the application will aspnet_wp.exe or w3wp.exe depending on your system. The application will run under a different security context than the interactive user (under the context of the ASPNET user by default). When placing the dll-s outside of your application directory you should consider that the PATH environment variable may differ between the interactive and the ASPNET user and/or you may not have enough permission to access a dll outside of your application folder.
fr: Vous allez peut être trouver que l'interface mapscript C# se comporte différemment pour le bureau et pour des application ASP.NET. Malgré le fait que vous puissiez lancer correctement l'exemple drawmap, vous rencontrerez peut-être le problème de chargement de dlls avec les applications ASP.NET. Quand vous créez un projet ASP.NET, votre répertoire d'application sera '\Inetpub\wwwroot\[YourApp]\bin' par défaut. Le processus hôte de l'application sera aspnet_wp.exe ou w3wp.exe en fonction de votre système. L'application tournera dans un context de sécurité différent de l'utilisateur interactif (sous le contexte de l'utilisateur ASPNET par défaut). Quand vous placez les dll-s en dehors de votre répertoire d'application, vous devriez prendre en compte que la variable d'environnement PATH environment puisse différer entre l'utilisateur interactif et ASPNET et/ou que nous n'ayiez pas assez de droits pour accéder à une dll en dehors de votre répertoire d'application.
zh: 您可能注意到 mapscript C# 接口在桌面和 ASP.NET 应用程序中具有不同表现。尽管您可以正确运行绘制地图示例，在 ASP.NET 应用程序中您可能会遇到动态链接库加载问题。在创建一个 ASP.NET 项目时，您的应用程序文件夹将会默认为 '\Inetpub\wwwroot\[YourApp]\bin'。根据您的操作系统，程序主进程为 aspnet_wp.exe 或 w3wp.exe。该应用程序将会在一个不同于交互用户的安全环境 (默认在 ASPNET 用户环境) 下运行。将动态链接库文件存放在您的应用程序目录以外的时候，您应当考虑在交互与 ASPNET 用户环境下路径环境变量的差异和/或您可能没有足够的权限访问您的程序文件夹以外的动态链接库文件。

source: Error
fr: Erreur
