Repository: 3x0dv5/docs
Catalog: translated/*/glossary.po
Languages: fr

source: Glossary
fr: Glossaire

source: `Anti-Grain Geometry <http://antigrain.com>`__ A high quality graphics rendering engine that MapServer 5.0+ can use. It supports sub-pixel anti-aliasing, as well as many more features.
fr: Anti-Grain Geometry est un moteur de rendu graphique de haute qualité que peut utiliser MapServer 5.0+. Il gère l’anticrênelage en dessous du pixel ainsi que d’autres fonctionnalités.

source: Wikipedia provides excellent coverage of `CGI <http://en.wikipedia.org/wiki/Common_Gateway_Interface>`_.
fr: Wikipedia propose une très bonne définition sur `CGI <http://en.wikipedia.org/wiki/Common_Gateway_Interface>`_.

source: EPSG codes are numeric codes associated with coordinate system definitions. For instance, EPSG:4326 is geographic WGS84, and EPSG:32611 is "UTM zone 11 North, WGS84". The WMS protocol uses EPSG codes to describe coordinate systems. EPSG codes are published by the `OGP Surveying and Positioning Committee <http://www.epsg.org/>`_. A list of PROJ.4 definitions corresponding to the EPSG codes can be found in the file /usr/local/share/proj/epsg. :ref:`PROJECTION` describes how to use these in your :ref:`mapfile`.
fr: Les codes EPSG sont des codes numériques associés à des définitions de système de coordonnées. Par exemple, le code EPSG:4326 correspond au WGS84 géographique, et EPSG:32611 correspond au "UTM zone 11 Nord, WGS84". Le protocole WMS utilise les codes EPSG pour décrire les systèmes de coordonnées. Les codes EPSG sont publiés par le `comité de Positionnement et de Recherche de l'OGP <http://www.epsg.org/>`_. Une liste de définitions PROJ.4 correspondant aux codes EPSG peut être trouvée dans le fichier /usr/local/share/proj/epsg. :ref:`PROJECTION` décrit comment les utiliser dans votre :ref:`mapfile`.

source: `Filter Encoding <http://www.opengeospatial.org/standards/filter>`__ is an :term:`OGC` standard which defines an XML encoding for filter expressions to allow for spatial and attribute querying.
fr: `Filter Encoding <http://www.opengeospatial.org/standards/filter>`__ est un standard de l\':term:`OGC` qui définie un encodage XML pour des expressions de filtre pour permettre des requêtes attributaires et spatiales.

source: `FreeType <http://freetype.sourceforge.net/index2.html>`__ is a font engine that MapServer uses for accessing and rendering `TrueType <http://en.wikipedia.org/wiki/True_Type_Font>`__ fonts.
fr: `FreeType <http://freetype.sourceforge.net/index2.html>`__ est un moteur de police que MapServer utilise pour accéder et afficher des polices `TrueType <http://en.wikipedia.org/wiki/True_Type_Font>`__.

source: `GD <http://www.libgd.org/Main_Page>`__ is a graphics library for dynamic generation of images. It was the first graphics renderer that was available for MapServer, and it is required by MapServer to operate.
fr: `GD <http://www.libgd.org/Main_Page>`__ est une bibliothèque graphique pour la génération dynamique d'images. Il a été le premier moteur d'affichage graphique qui était disponible pour MapServer, et il est nécessaire pour MapServer puisse fonctionner.

source: GDAL (Geospatial Data Abstraction Library) is a multi-format raster reading and writing library. It is used as the primary mechanism for reading raster data in MapServer. It is hosted at http://www.gdal.org/
fr: GDAL (Geospatial Data Abstraction Library) est une bibliothèque de lecture et d'écriture de raster multiformats. Il est utilisé comme premier mécanisme pour lire les données raster dans MapServer. Il est hébergé sur http://www.gdal.org/

source: `Geometry Engine Open Source <http://trac.osgeo.org/geos>`__ is a C/C++ port of the `Java Topology Suite <http://www.vividsolutions.com/jts/jtshome.htm>`__. It is used for geometric algebra operations like determining if a polygon is contained in another polygon or determining the resultant intersection of two or more polygons. MapServer optionally uses GEOS for geometric algebra operations.
fr: `Geometry Engine Open Source <http://trac.osgeo.org/geos>`__ est un port C/C++ de `Java Topology Suite <http://www.vividsolutions.com/jts/jtshome.htm>`__. Il est utilisé pour les opérations algébrique géométrique pour déterminer si un polygone est contenu dans un autre polygone ou déterminer l'intersection résultante de deux ou plusieurs polygones. MapServer peut utiliser GEOS pour des opérations algébriques.

source: `Geography Markup Language <http://www.opengeospatial.org/standards/gml>`__ is an :term:`OGC` standard which defines an abstract model for geographic features
fr: `Geography Markup Language <http://www.opengeospatial.org/standards/gml>`__ est un standard de l\':term:`OGC` qui définit un modèle abstrait pour les objets géographiques.

source: `GPS eXchange <http://en.wikipedia.org/wiki/GPX_(data_transfer)>`__ Format is an XML Schema for describing GPS data. :term:`OGR` can be used to transform and render this data with MapServer.
fr: Le format `GPS eXchange <http://en.wikipedia.org/wiki/GPX_(data_transfer)>`__ est un schéma XML pour décrire les données GPS. :term:`OGR` peut être utilisé pour transformer et afficher ces données avec MapServer.

source: A treatise of mapping scale can be found on `about.com <http://geography.about.com/cs/maps/a/mapscale.htm>`_.
fr: Un traité d'échelle cartographique peut être trouvé sur `about.com <http://geography.about.com/cs/maps/a/mapscale.htm>`_.

source: :ref:`Mapfile <mapfile>` is the declarative language that MapServer uses to define data connections, map styling, templating, and server directives. Its format is xml-like and hierarchical, with closing ``END`` tags, but the format is not xml.
fr: :ref:`Mapfile <mapfile>` est le langage déclaratif que MapServer utilise pour définir les connections aux données, la sémiologie des cartes, les modèles, et les directives des serveurs. Son format est proche du XML et hiérarchique, avec des balises fermantes ``END``, mais le format n'est pas du xml.

source: :ref:`mapscript` is an alternative the the :ref:`cgi` application of :ref:`mapserv` that allows you to program the MapServer object API in many languages.
fr: :ref:`mapscript` est une alternative aux applications :ref:`cgi` de :ref:`mapserv` qui vous permet de programmer l'API objet de MapServer en plusieurs langages.

source: Wikipedia provides excellent coverage of the `Mercator projection <http://en.wikipedia.org/wiki/Mercator_projection>`_.
fr: Wikipedia propose un excellent article de la `projection Mercator <http://en.wikipedia.org/wiki/Mercator_projection>`_.

source: The `Open Geospatial Consortium <http://www.opengeospatial.org>`_ is a standards organization body in the GIS domain. MapServer supports numerous OGC standards.
fr: L'`Open Geospatial Consortium <http://www.opengeospatial.org>`_ est un organisme de standardisation dans le domaine du SIG. MapServer gère de nombreux standards de l'OGC.

source: `OGR <http://www.gdal.org/ogr>`__ is the vector data access portion of the :term:`GDAL` library. It provides access to a multitude of data formats.
fr: `OGR <http://www.gdal.org/ogr>`__ est la partie accès aux données vecteur de la bibliothèque :term:`GDAL`. Elle fournit un accès à une multitude de formats de données.

source: `Observations and Measurements <http://www.opengeospatial.org/standards/om>`__ is an :term:`OGC` standard which defines an abstract model for sensor based data.
fr: `Observations and Measurements <http://www.opengeospatial.org/standards/om>`__ est un standard de l\':term:`OGC` qui définit un modèle abstrait pour les capteurs de données.

source: `OpenLayers <http://openlayers.org>`__ is a JavaScript library for developing draggable, "slippy map" web applications.
fr: `OpenLayers <http://openlayers.org>`__ est une bibliothèque JavaScript pour des applications web de cartographie.

source: `Proj4 <http://trac.osgeo.org/proj/>`__ is a library for projecting map data. It is used by MapServer and GDAL and a multitude of other Open Source GIS libraries.
fr: `Proj4 <http://trac.osgeo.org/proj/>`__ est une bibliothèque pour projeter des données spatiales. Elle est utilisé par MapServer et GDAL et beaucoup d'autres bibliothèques SIG Open Source.

source: A map projection is a mathematical transformation of the surface of a sphere (3D) onto a 2D plane. Due to the laws of the universe, each type of projection must make tradeoffs on how and what features it distorts.
fr: Une projection cartographique est une transformation mathématique d'un volume d'une sphère (3D) en un plan 2D. À cause des lois de l'univers, chaque types de projection doit faire des compromis sur comment et quelles géométries sont transformées.

source: A raster is a rectangular grid of pixels. Essentially an image. Rasters are supported in MapServer with a layer type of RASTER, and a variety of formats are supported including GeoTIFF, JPEG, and PNG.
fr: Un raster est une grille rectangulaire de pixels. Essentiellement une image. Les rasters sont gérés dans MapServer avec un type de couche définie à RASTER, et une variété de formats est géré incluant GeoTIFF, JPEG, et PNG.

source: Shapefiles are simple GIS vector files containing points, lines or areas. The format was designed and published by ESRI and is widely supported in the GIS world. It is effectively the native and highest performance format for MapServer.
fr: Les shapefiles sont de simples fichiers SIG vecteur contenant des points, des lignes ou des surfaces. Le format a été créé et publié par ESRI et il est très largement géré dans le monde SIG. Il est effectivement le format natif et le plus performant pour MapServer.

source: `SLD <http://www.opengeospatial.org/standards/sld>`__ is an :term:`OGC` standard which allows for custom symbolization for portrayal of data.
fr: `SLD <http://www.opengeospatial.org/standards/sld>`__ est un standard de l\':term:`OGC` qui permet la personnalisation de la sémiologie de cartes finales.

source: `SOS <http://www.opengeospatial.org/standards/sos>`__ is an :term:`OGC` standard which provides an API for managing deployed sensors and retrieving sensor and observation data.
fr: `SOS <http://www.opengeospatial.org/standards/sos>`__ est un standard de l\':term:`OGC` qui propose une API pour gérer des capteurs déployés et récupérer des données de capteurs et d'observations.

source: `Spherical Mercator <http://docs.openlayers.org/spherical_mercator/#what-is-spherical-mercator>`__ is a term used to describe the :ref:`PROJECTION` used by many commercial API providers.
fr: Spherical Mercator `Spherical Mercator <http://docs.openlayers.org/spherical_mercator/#what-is-spherical-mercator>`__ est une terme utilisé pour décrire la :ref:`PROJECTION` utilisé par plusieurs éditeurs d'API commerciales.

source: `Scalable Vector Graphics <http://en.wikipedia.org/wiki/SVG>`__ is an XML format that MapServer can output. It is frequently used in browser and mobile devices.
fr: `Scalable Vector Graphics <http://en.wikipedia.org/wiki/SVG>`__ est un format XML que MapServer peut renvoyer. Il est fréquemment utilisé dans les périphériques mobiles et les navigateurs.

source: `Shockwave Flash <http://en.wikipedia.org/wiki/SWF>`__ format that MapServer can generate for output.
fr: `Shockwave Flash <http://en.wikipedia.org/wiki/SWF>`__ format que MapServer peut générer en sortie.

source: `Simplified Wrapper Interface Generator <http://www.swig.org>`__ is the library that MapServer uses for generating the language bindings for all languages other than C/C++ and PHP. :ref:`mapscript` describes these bindings.
fr: `Simplified Wrapper Interface Generator <http://www.swig.org>`__ est la bibliothèque que MapServer utilise pour générer des liaisons de langages pour tous les langages autre que C/C++ et PHP. :ref:`mapscript` décrit ces liaisons.

source: A tileindex is a :term:`Shapefile` or other :term:`Vector` data source that contains footprints of :term:`Raster` data coverage. MapServer can use a tileindex to render a directory of raster data. The tileindex allows MapServer to only read the data that intersects the requested map extent, rather than reading all of the data.
fr: Un tileindex est un :term:`Shapefile` ou une autre source de données :term:`Vector` qui contient l'empreinte des couvertures de données :term:`Raster`. MapServer peut utiliser un tileindex pour afficher un répertoire de données raster. Le tileindex permet à MapServer de lire seulement les données qui intersectent l'étendue des cartes demandées, plutôt que de lire toutes les données.

source: Geographic features described by geometries (point, line, polygon) on a (typically) cartesian plane.
fr: Objets géographiques décrits par des géométries (point, ligne, polygone) sur un plan cartésien (généralement).

source: `WCS <http://en.wikipedia.org/wiki/Web_Coverage_Service>`__ is an :term:`OGC` standard that describes how to systematically produce structured :term:`Raster` cartographic data from a service and return them to a client
fr: `WCS <http://en.wikipedia.org/wiki/Web_Coverage_Service>`__ est un standard de l\':term:`OGC` qui décrit comment produire systématiquement des données cartographiques :term:`Raster` structurées à partir d'un service et les renvoyer à un client.

source: `WFS <http://en.wikipedia.org/wiki/Web_Feature_Service>`__ is an :term:`OGC` standard that describes how to systematically produce structured :term:`Vector` cartographic data from a service and return them to a client.
fr: `WFS <http://en.wikipedia.org/wiki/Web_Feature_Service>`__ est un standard de l\':term:`OGC` qui décrit comment produire systèmatiquement des données cartographiques :term:`Vector` structurées à partir d'un service et les renvoyer à un client.

source: `Web Map Context <http://www.opengeospatial.org/standards/wmc>`__ is an :term:`OGC` standard which allows for sharing of map views of :term:`WMS` layers in multiple applications.
fr: `Web Map Context <http://www.opengeospatial.org/standards/wmc>`__ est un standard de l\':term:`OGC` qui permet de partager des vues de cartes de couches :term:`WMS` dans plusieurs applications.

source: `WMS <http://en.wikipedia.org/wiki/Web_Map_Service>`__ is an :term:`OGC` standard that describes how to systematically produce rendered map images from a service and return them to a client.
fr: `WMS <http://en.wikipedia.org/wiki/Web_Map_Service>`__ est un standard de l\':term:`OGC` qui décrit comment produire systèmatiquement des images cartographiques à partir d'un service et de les renvoyer à un client.
