Repository: 3x0dv5/docs
Catalog: translated/*/introduction.po
Languages: fr

source: An Introduction to MapServer
fr: Une introduction à Mapserver

source: MapServer Overview
fr: Vue d'ensemble de Mapserver

source: MapServer is a popular Open Source project whose purpose is to display dynamic spatial maps over the Internet. Some of its major features include:
fr: Mapserver est un projet Open Source populaire dont le but est d'afficher des cartes dynamiques via Internet. Ces principales fonctionnalités incluent

source: support for display and querying of hundreds of raster, vector, and database formats
fr: le support de l'affichage et de l'interrogation de centaines de couches issues de raster, vecteur et de bases de données

source: ability to run on various operating systems (Windows, Linux, Mac OS X, etc.)
fr: la capacité à fonctionner sur des systèmes d'exploitation variés (Windows, Linux, Mac OS X, etc.)

source: support for popular scripting languages and development environments (PHP, Python, Perl, Ruby, Java, .NET)
fr: la gestion d'environnement de développement et de scripting (PHP, Python, Perl, Ruby, Java, .NET)

source: on-the-fly projections
fr: les projections à la volée

source: high quality rendering
fr: le rendu de grande qualité

source: fully customizable application output
fr: les formats de sortie très customisables

source: many ready-to-use Open Source application environments
fr: les nombreux environnements d'application Open Source prêts à l'emploi

source: In its most basic form, MapServer is a :term:`CGI` program that sits inactive on your Web server. When a request is sent to MapServer, it uses information passed in the request URL and the :ref:`Mapfile <mapfile>` to create an image of the requested map. The request may also return images for legends, scale bars, reference maps, and values passed as CGI variables.
fr: Dans sa forme la plus basique, Mapserver est un programme :term:`CGI` qui reste inactif sur votre serveur Web. Quand une requête est envoyée à Mapserver, il utilise les informations passées par l'URL interrogée et le fichier :ref:`Mapfile <mapfile>` pour créer une image de la carte demandée. La requête peut aussi renvoyer des images pour les légendes, les barres d'échelle, les cartes de situation, et les valeurs passées passées en tant que variables CGI.

source: The :ref:`gloss` contains an overview of many of the jargon terms in this document.
fr: Le :ref:`gloss` contient un aperçu de nombreux termes du jargon de ce document.

source: MapServer can be extended and customized through :ref:`MapScript <mapscript>` or :ref:`templating <template>`. It can be built to support many different :ref:`vector <vector>` and :ref:`raster <raster>` input data formats, and it can generate a multitude of :ref:`output <output>` formats. Most pre-compiled MapServer distributions contain most all of its features.
fr: MapServer peut être étendu et customisé par l'utilisation du :ref:`MapScript <mapscript>` ou du :ref:`templating <template>`. Il peut être compilé pour supporter de nombreux formats différents :ref:`vecteur <vector>` et :ref:`raster <raster>` en données d'entrées, et il peut générer une multitude de formats :ref:`de sortie <output>`. La plupart des paquets de Mapserver précompilés contiennent pour la plupart toutes ces fonctionnalités.

source: :ref:`unix` and :ref:`win32`
fr: :ref:`unix` et :ref:`win32`

source: :term:`MapScript` provides a scripting interface for MapServer for the construction of Web and stand-alone applications. MapScript can be used independently of CGI MapServer, and it is a loadable module that adds MapServer capability to your favorite scripting language. MapScript currently exists in :ref:`PHP <php_mapscript>`, Perl, :ref:`Python <python>`, Ruby, Tcl, Java, and .NET flavors.
fr: Le :term:`MapScript` fournit une interface de scripting pour MapServer pour la construction d'application Web et d'applications seules. MapScript peut être utilisé indépendamment du binaire CGI MapServer, et est un module chargeable qui met à disposition les capacités de Mapserver dans votre langage de scripting favori. MapScript existe actuellement pour :ref:`PHP <php_mapscript>`\, Perl, :ref:`Python <python>`\, Ruby, Tcl, Java et .NET.

source: This guide will not explicitly discuss MapScript, check out the :ref:`MapScript Reference <mapscript>` for more information.
fr: Ce guide n'abordera pas explicitement MapScript, vérifier la :ref:`référence MapScript <mapscript>` pour plus d'informations.

source: Anatomy of a MapServer Application
fr: Anatomie d'une application Mapserver

source: The basic architecture of MapServer applications.
fr: L'architecture basique des applications Mapserver

source: A simple MapServer application consists of:
fr: Une application MapServer simple consiste en:

source: **Map File** - a structured text configuration file for your MapServer application. It defines the area of your map, tells the MapServer program where your data is and where to output images. It also defines your map layers, including their data source, projections, and symbology. It must have a .map extension or MapServer will not recognize it.
fr: Un **Map File** - un fichier de configuration texte structuré pour votre application MapServer. Il définit l'étendue de votre carte, indique au programme MapServer où est votre donnée et où sont produites les images de sortie. Il définit aussi vos couches cartographiques, en incluant leur source de donnée, leurs projections, et leur symbologie. Il doit obligatoirement avoir une extension de type .map ou alors MapServer ne le reconnaîtra pas.

source: :ref:`MapServer Mapfile Reference <mapfile>`
fr: :ref:`Référence Mapfile de MapServer <mapfile>`

source: **Geographic Data** - MapServer can utilize many geographic data source types. The default format is the ESRI Shape format. Many other data formats can be supported, this is discussed further below in `Adding data to your site`_.
fr: **Des données géographiques** - Mapserver peut utiliser de nombreux type de source de données géographiques. Le format par défault est le format Shape de ESRI. D'autres types de format de données peuvent être supportés, ceci est abordé plus en détails plus bas dans `Ajouter des données à votre site <Adding data to your site>`_.

source: :ref:`Vector Input Reference <vector>` and :ref:`Raster Input Reference <raster>`
fr: :ref:`Référence des entrées vecteur <vector>` et :ref:`Référence des entrées raster <raster>`

source: **HTML Pages** - the interface between the user and MapServer . They normally sit in Web root. In it's simplest form, MapServer can be called to place a static map image on a HTML page. To make the map interactive, the image is placed in an HTML form on a page.
fr: **des pages HTML** - l'interface entre l'utilisateur et MapServer. Elles sont normalement placés dans la racine du serveur Web. Dans sa forme la plus simple, MapServer peut être appelé pour ajouter une image de carte statique dans une page HTML. Pour rendre la carte interactive, l'image est placée dans un formulaire HTML sur une page.

source: :term:`CGI` programs are 'stateless', every request they get is new and they don't remember anything about the last time that they were hit by your application. For this reason, every time your application sends a request to MapServer, it needs to pass context information (what layers are on, where you are on the map, application mode, etc.) in hidden form variables or URL variables.
fr: Les programmes :term:`CGI` sont 'sans état', chaque requête qu'ils reçoivent est nouvelle et ils ne se souviennent de rien à propos de la dernière fois où ils ont été accédés par votre application. Pour cette raison, chaque fois que votre application envoie un requête à Mapserver, il est nécessaire de passer des informations de contexte (quelles couches sont actives,où êtes vous sur la carte, le mode de l'application, etc.) par des champs cachés de formulaires ou par des variables passées dans l'URL.

source: A simple MapServer :ref:`cgi` application may include two HTML pages:
fr: Une application :ref:`cgi` MapServer simple peut inclure deux pages HTML:

source: **Initialization File** - uses a form with hidden variables to send an initial query to the web server and MapServer. This form could be placed on another page or be replaced by passing the initialization information as variables in a URL.
fr: **Une fichier d'initialisation** - il utilise un formulaire avec des variables cachées pour envoyer une requête initiale au serveur web et à MapServer. Ce formulaire peut être placé sur une autre page ou être remplacé en passant l'information d'initialisation comme variables dans une URL.

source: **Template File** - controls how the maps and legends output by MapServer will appear in the browser. By referencing MapServer CGI variables in the template HTML, you allow MapServer to populate them with values related to the current state of your application (e.g. map image name, reference image name, map extent, etc.) as it creates the HTML page for the browser to read. The template also determines how the user can interact with the MapServer application (browse, zoom, pan, query).
fr: **Un fichier de template** - il contrôle comment les cartes et les légendes produites par MapServer vont apparaître dans le navigateur. En référençant les variables CGI MapServer dans le template HTML, vous autorisez MapServer à les remplir avec des valeurs relatives à l'état courant de votre application (c'est à dire le nom de l'image de carte, celui de la carte de situation, l'étendue de la carte, etc.) au fur et à mesure qu'il créé la page HTML pour qu'elle soit lue par le navigateur. Le template détermine aussi comment l'utilisateur peut interagir avec l'application MapServer (naviguer, zoomer, se déplacer, interroger).

source: **MapServer CGI** - The binary or executable file that receives requests and returns images, data, etc. It sits in the cgi-bin or scripts directory of the web server. The Web server user must have execute rights for the directory that it sits in, and for security reasons, it should not be in the web root. By default, this program is called :ref:`mapserv`
fr: **le CGI MapServer** - Le binaire ou fichier exécutable qui reçoit et renoie les images, les données, etc. Il se situe dans le répertoire cgi-bin ou scripts de votre serveur web. L'utilisateur de serveur web doit avoir les droits d'exécution sur le répertoire qui contient le binaire, et pour des raisons de sécurité, il ne devrait pas être à la racine du serveur web. Par défaut, ce programme s'appelle :ref:`mapserv`

source: **Web/HTTP Server** - serves up the HTML pages when hit by the user's browser. You need a working Web (HTTP) server, such as `Apache <http://httpd.apache.org>`__ or Microsoft Internet Information Server, on the machine on which you are installing MapServer.
fr: **Un serveur Web/HTTP** - il sert les pages HTML quand il est appelé par le navigateur de l'utilisateur. Vous devez avoir un serveur web (HTTP) qui fonctionne, comme `Apache <http://httpd.apache.org>`__ ou Microsoft Internet Information Server (IIS), sur la machine sur lequel vous installez MapServer.

source: Installation and Requirements
fr: Installation et pré-requis

source: Windows Installation
fr: Installation Windows

source: OSGeo4W is a new Windows installer that downloads and/or updates MapServer, add-on applications, and also other Open Source geospatial software. The following steps illustrate how to use OSGeo4W:
fr: OSGeo4W est un nouvel installateur Windows qui télécharge et/ou met à jour MapServer, des suppléments pour les applications, et aussi d'autres logiciels géospatiaux Open Source. Les étapes suivantes illustrent comment utiliser OSGeo4W:

source: Download OSGeo4W http://download.osgeo.org/osgeo4w/osgeo4w-setup.exe
fr: Télécharger OSGeo4W http://download.osgeo.org/osgeo4w/osgeo4w-setup.exe

source: Execute (double-click) the .exe
fr: Exécuter (en double-cliquant) le fichier .exe

source: Choose "Advanced" install type
fr: Choisir l'installation de type "Advanced" (avancée)

source: Express contains options for higher-level packages such as MapServer, GRASS, and uDig. Advanced gives you full access to choosing commandline tools and applications for MapServer that are not included in the Express install
fr: L'installation "Express" contient des options pour des paquets de haut-niveau comme MapServer, GRASS, et uDig. Celle "Advanced" vous permet de choisir tous les outils en ligne de commande et toutes les application pour Mapserver qui ne sont pas incluses dans l'installation "Express"

source: Select packages to install
fr: Sélectionner les paquets à installer

source: Click on the "Default" text beside the higher-level packages (such as Web) to install all of Web's sub-packages, or click on the "Skip" text beside the sub-package (such as MapServer) to install that package and all of its dependencies.
fr: Cliquer sur le texte "Default" (par défaut) près des paquets de haut-niveau (comme Web) pour installer tous les sous-paquets de Web, ou cliquer sur le texte "Skip" (ignorer) près des sous-paquets (comme MapServer) pour installer ce paquet et toutes ces dépendances.

source: Let the installer fetch the packages.
fr: Laisser l'installeur récupérer les paquets.

source: Run the apache-install.bat script to install the Apache Service.
fr: Lancer le script apache-install.bat pour installer le service Apache.

source: You must run this script under the "OSGeo4W Shell". This is usually available as a shortcut on your desktop
fr: Vous devez lancer ce script par l'intermédiaire de l'"OSGeo4W Shell". Il est habituellement disponible comme raccourci sur votre Bureau

source: An apache-uninstall.bat script is also available to remove the Apache service installation.
fr: Un script apache-uninstall.bat est aussi disponible pour enlever l'installation du service Apache.

source: Start Apache from the OSGeo4W shell and navigate to http://127.0.0.1
fr: Démarrer Apache depuis le "OSGeo4W shell" et ouvrer votre navigateur à l'adresse http://127.0.0.1

source: Verify that MapServer is working
fr: Vérifier que Mapserver fonctionne

source: Hardware Requirements
fr: Pré-requis matériel

source: MapServer runs on Linux, Windows, Mac OS X, Solaris, and more. To compile or install some of the required programs, you may need administrative rights to the machine. People commonly ask questions about minimum hardware specifications for MapServer applications, but the answers are really specific to the individual application. For development and learning purposes, a very minimal machine will work fine. For deployment, you will want to investigate :ref:`optimization` of everything from your data to server configuration.
fr: MapServer fonctionne sous Linux, Windows, Mac OS X, Solaris, et plus. Pour compiler ou installer quelques uns des programmes requis, vous aurez peut être besoin des droits administrateur sur votre machine. Les gens demandent souvent quelles sont les spécifications matérielles pour les applications MapServer, mais ces réponses sont spécifiques à chaque application en particulier. Pour des raisons de développement et d'apprentissage, une machine avec une configuration minimale fonctionnera très bien. Pour le déploiement, vous pourrez surement approfondir l'\:ref:`optimisation <optimization>` , de vos données jusqu'à votre configuration serveur.

source: Software Requirements
fr: Pré-requis logiciel

source: You need a working and properly configured Web (HTTP) server, such as `Apache <http://httpd.apache.org/>`__ or Microsoft Internet Information Server, on the machine on which you are installing MapServer. OSGeo4W contains Apache already, but you can reconfigure things to use IIS if you need to. Alternatively, `MS4W <http://www.maptools.org/ms4w/index.phtml>`__ can be used to install MapServer on Windows.
fr: Vous avez besoin d'un serveur Web (HTTP) qui marche et qui est correctement configuré, comme `Apache <http://httpd.apache.org/>`__ ou Microsoft Internet Information Server (IIS), sur la machine sur laquelle vous installez MapServer. OSGeo4W contient déjà un Apache, mais vous pouvez reconfigurer les choses pour utiliser IIS si vous en avez besoin. Comme alternative, vous pouvez utiliser `MS4W <http://www.maptools.org/ms4w/index.phtml>`__ pour installer MapServer sur Windows.

source: If you are on a Windows machine, and you don't have a web server installed, you may want to check out `MS4W <http://www.maptools.org/ms4w/index.phtml>`__, which will install a pre-configured web server, MapServer, and more. The `FGS Linux Installer <http://www.maptools.org/fgs/>`__ provides similar functionality for several Linux distributions.
fr: Si vous êtes sur une machine Windows, et que vous n'avez pas un serveur web installé, vous voudrez peut être essayer `MS4W <http://www.maptools.org/ms4w/index.phtml>`__, qui installera un serveur web pré-configuré, MapServer et plus. L'`installateur Linux FGS <http://www.maptools.org/fgs/>`__ fournit des fonctionnalités similaires pour des nombreuses distributions Linux.

source: This introduction will assume you are using pre-compiled OSGeo4W Windows binaries to follow along. Obtaining MapServer or :ref:`Linux <linux>` or :ref:`Mac OS X <osx>` should be straightforward. Visit :ref:`download` for installing pre-compiled MapServer builds on Mac OS X and Linux.
fr: Cette introduction suppose que vous utilisez les binaires Windows OSGEO4W pré-compilés pour la suite. Avoir MapServer sur :ref:`Linux <linux>` ou :ref:`Mac OS X <osx>` devrait se faire très simplement. Visiter la partie :ref:`Téléchargement <download>`_ pour installer des paquets pré-compilés pour MapServer sur Mac OS X et Linux.

source: You will also need a Web browser, and a text editor (vi, emacs, notepad, homesite) to modify your HTML and :ref:`mapfiles <mapfile>`.
fr: Vous aurez aussi beson d'un navigateur Web, et d'un éditeur de texte (vi, emacs, notepad, homesite) pour modifier votre HTML et vos :ref:`mapfiles <mapfile>`.

source: Skills
fr: Compétences

source: In addition to learning how the different components of a MapServer application work together and learning Map File syntax, building a basic application requires some conceptual understanding and proficiency in several skill areas.
fr: En plus d'apprendre comment les différents composants d'une application MapServer fonctionnent ensemble et d'apprendre la syntaxe des Map File, construire une application basique nécessite la compréhension de certains concepts ainsi qu'une maîtrise de plusieurs domaines de compétence.

source: You need to be able to create or at least modify `HTML <http://www.w3.org/MarkUp/Guide/>`__ pages and understand how HTML forms work. Since the primary purpose of a MapServer application is to create maps, you will also need to understand the basics of geographic data and likely, map projections. As your applications get more complex, skills in SQL, DHTML/Javascript, Java, databases, expressions, compiling, and scripting may be very useful.
fr: Vous devez être capable de créer ou au minimum de modifier des pages `HTML <http://www.w3.org/MarkUp/Guide/>`__ et de comprendre comment les formulaires HTML fonctionnent. Comme le premier but d'une application MapServer est de créer des cartes, vous devez aussi comprendre les bases sur les données géographiques et vraisemblablement les projections cartographiques. Au fur et à mesure que vos applications deviendront complexes, des compétences en SQL, DHTML/Javascript, Java, base de données, expressions régulières, compilation et scripting s'avéreront surement très utiles.

source: Introduction to the :ref:`Mapfile <mapfile>`
fr: Introduction au :ref:`Mapfile <mapfile>`

source: The .map file is the basic configuration file for data access and styling for MapServer. The file is an ASCII text file, and is made up of different objects. Each object has a variety of parameters available for it. All .map file (or mapfile) parameters are documented in the :ref:`mapfile reference <mapfile>`. A simple mapfile example displaying only one layer follows, as well as the map image output:
fr: Le fichier .map est un fichier de configuration basique pour accéder aux données et aux styles pour MapServer. Le fichier est un fichier texte ASCII, et est constitué de différents objets. Chaque objet a une variété de paramètres disponibles pour lui. Tous les paramètres d'un fichier .map (ou mapfile) sont documentés dans la :ref:`référence de mapfile <mapfile>`. Un exemple de mapfile simple n'affichant qu'une seule couche est visible ci-dessous, suivi du rendu image associé :

source: Rendered Bluemarble Image
fr: Rendu d'image Bluemarble

source: Comments in a mapfile are specified with a '#' character
fr: Les commentaires dans un mapfile sont spécifiés avec un caractère '#'

source: MapServer parses mapfiles from top to bottom, therefore layers at the end of the mapfile will be drawn last (meaning they will be displayed on top of other layers)
fr: MapServer parse les mapfiles du haut vers le bas, en conséquent les couches à la fin du mapfile sont celles qui seront dessinées en dernier (ce qui veut dire qu'elles seront affichées par dessus les autres couches)

source: Using relative paths is always recommended
fr: L'utilisation des chemins relatifs est toujours recommandé

source: Paths should be quoted (single or double quotes are accepted)
fr: Les chemins doivent être placés entre guillemets (les guillemets simples et doubles sont acceptés)

source: The above example is built on the following directory structure:
fr: L'exemple ci-dessus est construit en utilisant la structure de répertoire suivante :

source: The mapfile could be placed anywhere, as long as it is accessible to the web server. Normally, one would try to avoid placing it at a location that makes it accessible on the web. Let us say it is placed in /home/msuser/mapfiles/
fr: Le mapfile peut être placé n'importe où, à partir du moment où il est accessible par le serveur web. Normalement, vous devriez essayer d'éviter de le placer dans un endroit qui le rende accessible sur le web. Admettons qu'il est placé dans /home/msuser/mapfiles/

source: The location of the font file is given relative to the map file, in this case: /home/msuser/etc/fonts.txt
fr: L'emplacement du fichier de liste des police est donné relativement au mapfile, dans ce cas: /home/msuser/etc/fonts.txt

source: The location of the datasets (`bluemarble.gif`) is given relative to the map file, in this case: /home/msuser/data/
fr: L'emplacement de la source de données (`bluemarble.gif`) est donné relativement au mapfile, dans ce cas: /home/msuser/data/

source: The location of the symbol file is given relative to the map file, in this case: /home/msuser/etc/symbols.txt
fr: L'emplacement du fichier de liste de symboles est donné relativement au mapfile, dans ce cas: /home/msuser/etc/symbols.txt

source: The files generated by MapServer will be placed in the directory /ms4w/tmp/ms_tmp/. The web server must be able to place files in this directory. The web server must make this directory available as /ms_tmp (if the web server is on `www.ms.org`, the web address to the directory must be: `httpd://www.ms.org/ms_tmp/`.
fr: Les fichiers générés par Mapserver seront placés dans le répertoire /ms4w/tmp/ms_tmp/. Le serveur web doit obligatoirement être capable d'écrire des fichiers dans ce répertoire. Le serveur web doit aussi rendre ce répertoire disponible comme /ms_tmp (si le serveur web est sur `www.ms.org`, l'adresse web du répertoire devra être: `httpd://www.ms.org/ms_tmp/`.

source: :ref:`MAP` Object
fr: L'objet :ref:`MAP`

source: EXTENT is the output extent in the units of the output map
fr: EXTENT est l'étendue de sortie dans l'unité de la carte

source: SIZE is the width and height of the map image in pixels
fr: SIZE est la largeur et la hauteur de l'image de la carte en pixels
