Repository: 3x0dv5/docs
Catalog: translated/*/introduction.po
Languages: fr

source: **Tile Your Data** - Ideally, your data will be 'sliced up' into pieces about the size in which it will be displayed. There is unnecessary overhead when searching through a large Shape dataset or image of which you are only going to display a small area. By breaking the data up into tiles and creating a tile index, MapServer only needs to open up and search the data files of interest. Shape datasets can be broken into smaller tiles and then a tileindex Shape dataset can be created using the :ref:`tile4ms <tile4ms>` utility. A :ref:`tileindex <tileindex>` Shape dataset for raster files can also be created.
fr: **Tuiler vos données** - Idéalement, votre donnée sera 'découpé' en morceaux de la taille dans laquelle elle sera affichée. Il y a une surcharge inutile quand on cherche dans un jeu de données Shape ou une image qui sera seulement affichée sur une petite partie. En découpant les données en tuiles et en créant un index de tuile, MapServer a besoin seulement d'ouvrir et de chercher les fichiers de données utiles. Les jeux de données Shape peuvent être découpés en petits morceaux et ensuite un index de tuile de Shape peut être créé en utilisant l'utilitaire :ref:`tile4ms <tile4ms>`. Un :ref:`index de tuile <tileindex>` d'un jeu de données Shape pour des fichiers raster peut aussi être créé.

source: **Pre-Classify Your Data** - MapServer allows for the use of quite complex :ref:`EXPRESSIONs <expressions>` to classify data. However, using logical and regular expressions is more resource intensive than string comparisons. To increase efficiency, you can divide your data into classes ahead of time, create a field to use as the `CLASSITEM` and populate it with a simple value that identifies the class, such as 1,2,3, or 4 for a four class data set. You can then do a simple string comparison for the class `EXPRESSION`.
fr: **Pré-classifier votre donnée** - MapServer vous permet pour l'usage d' :ref:`EXPRESSIONs <expressions>` plutôt complexes de classer vos données. Cependandant, l'utilisation des expressions logiques et régulières consomme plus de ressources que les comparaisons de chaînes. Pour augmenter l'efficacité, vous pouvez diviser vos données en classe par avance, créer un champ pour l'utiliser comme `CLASSITEM` et le peupler avec des valeurs simples qui identifie la classe comme 1,2,3, ou 4 pour un jeu de données divisé en 4 classes. Vous pouvez ensuite faire un comparaison de chaîne simple pour la classe `EXPRESSION`.

source: **Pre-Process Your Images** - Do resource intensive processing up front. See the :ref:`Raster Data reference <raster>` for more info.
fr: **Pré-traité vos images** - Faire les traitements consommateurs de ressources à l'avance. Voir :ref:`la référence des données Raster <raster>` pour plus d'infos.

source: **Generalize for Overview** - create a more simple, generalized data layer to display at small scales, and then use scale-dependent layers utilizing :ref:`LAYER` `MINSCALE` and `LAYER` `MAXSCALE` to show more detailed data layers as the user zooms in. This same concept applies to images.
fr: **Généraliser pour les aperçus** - créer une couche de données généralisée, plus simple pour des rendus à petite échelle, et ensuite utiliser des couches paramétrées par échelle en utilisant :ref:`LAYER` `MINSCALE` et `LAYER` `MAXSCALE` pour montrer les couches de données détaillées au fur et à mesure du zoom de l'utilisateur. Le même concept s'applique aux images.

source: How do I get Help?
fr: Comment obtenir de l'aide?

source: Official MapServer documentation lives here on this :ref:`site <documentation>`.
fr: La documentation officielle de MapServer est disponible sur cette :ref:`site <documentation>`.

source: User contributed documentation exists on the MapServer `Wiki <https://github.com/mapserver/mapserver/wiki/>`__.
fr: La documentation contributive des utilisateurs est consultable et éditable sur sur le `Wiki <https://github.com/mapserver/mapserver/wiki/>`__ MapServer.

source: Users Mailing List
fr: Liste de diffusion utilisateurs

source: Register and post questions to the `MapServer Users <http://lists.osgeo.org/mailman/listinfo/mapserver-users/>`__ mailing list. Questions to the list are usually answered quickly and often by the developers themselves. A few things to remember:
fr: S'enregistrer et poser les questions sur la liste de diffusion des `utilisateurs MapServer <http://lists.osgeo.org/mailman/listinfo/mapserver-users/>`__. Les questions sur la liste trouvent habituellement une réponse assez rapide et parfois par les développeurs du projet. Quelques petites choses à se rappeler:

source: `Search the archives <http://n2.nabble.com/MapServer-f1969210.html>`__ for your answer first, people get tired of answering the same questions over and over.
fr: `En premier, chercher dans les archives <http://n2.nabble.com/MapServer-f1969210.html>`__ pour essayer de trouver votre réponse, les gens sont fatigués de répondre aux mêmes questions encore et encore.

source: Provide version and configuration information for your MapServer installation, and relevant snippets of your map and template files.
fr: Indiquer la version utilisée et les informations de configuration pour votre installation de MapServer ainsi que des extraits de code pertinents de votre fichier .map et de vos fichiers de template.

source: Always post your responses back to the whole list, as opposed to just the person who replied to your question.
fr: Toujours répondre à l'ensemble de la liste plutôt que de répondre seulement à la personne qui vous a apporté une réponse

source: MapServer users and developers can be found on Internet Relay Chat. The channel is #mapserver on irc.freenode.net.
fr: Utilisateurs et développeurs de MapServer peuventêtre trouvés sur l'IRC (Internet Relay Chat). La salle est #mapserver sur le serveur irc.freenode.net.

source: Reporting bugs
fr: Signaler des bugs

source: Bugs (software and documentation) are reported on the `MapServer issue tracker <http://trac.osgeo.org/mapserver>`__.
fr: Les bugs (logiciels et documentation) sont reportés sur le `gestionnaire de suivi de bugs <http://trac.osgeo.org/mapserver>`__.

source: Tutorial
fr: Tutoriel

source: `Here <http://www.mapserver.org/en/tutorial/>`__ is a quick tutorial for new users.
fr: `Ici <http://www.mapserver.org/fr/tutorial/>`__ est disponible un tutoriel rapide pour les nouveaux utilisateurs.

source: Test Suite
fr: Suite de tests

source: Download the `MapServer Test Suite <https://github.com/mapserver/mapserver/wiki/Test-Suite/>`__ for a demonstration of some MapServer functionality.
fr: Téléchargez la `suite de tests MapServer <https://github.com/mapserver/mapserver/wiki/Test-Suite/>`__ pour une démonstration de quelques fonctionnalités de Mapserver

source: Books
fr: Livres

source: `Web Mapping Illustrated <http://www.oreilly.com/catalog/webmapping/>`__\, a book by Tyler Mitchell that describes well and provides real-world examples for the use of Web mapping concepts, Open Source GIS software, MapServer, Web services, and PostGIS.
fr: `Web Mapping Illustrated <http://www.oreilly.com/catalog/webmapping/>`__\, un livre de Tyler Mitchell qui décrit et fournit des exemples de cas réels pour l'utilisation des concepts liés à la cartographie en ligne, les logiciels SIG Open Source, MapServer, les Webservices, et PostGIS.

source: `Mapping Hacks <http://www.oreilly.com/catalog/mappinghks/>`__\, by Schuyler Erle, Rich Gibson, and Jo Walsh, creatively demonstrates digital mapping tools and concepts. MapServer only appears in a handful of the 100 hacks, but many more are useful for concepts and inspiration.
fr: `Mapping Hacks <http://www.oreilly.com/catalog/mappinghks/>`__\, écrit par Schuyler Erle, Rich Gibson, et Jo Walsh, il démontre l'usage possible des outils de cartographie informatique et des concepts associés. MapServer n'apparaît seulement que dans quelques cas parmi les 100 hacks, mais beaucoup sont utiles pour les concepts et les sources d'inspiration.

source: `Beginning MapServer: Opensource GIS Development <http://www.apress.com/book/bookDisplay.html?bID=443>`__\, by Bill Kropla. According to the publisher, it covers installation and configuration, basic MapServer topics and features, incorporation of dynamic data, advanced topics, MapScript, and the creation of an actual application.
fr: `Beginning MapServer : Opensource GIS Development <http://www.apress.com/book/bookDisplay.html ?bID=443>`__\, de Bill Kropla. En se référant à la notice de l'éditeur, il couvre l'installation et la configuration, les sujets et les fonctionnalités basiques de MapServer, l'utilisation des données dynamiques, des sujets plus avancés, le MapScript, et la création d'une application réelle.
