Repository: 3x0dv5/docs
Catalog: translated/*/introduction.po
Languages: fr

source: IMAGECOLOR is the default image background color
fr: IMAGECOLOR est la couleur de fond par défaut de l'image

source: MapServer currently uses a pixel-center based extent model which is a bit different from what GDAL or WMS use.
fr: MapServer actuellement fonctionne sur un modèle d'étendue basé sur un pixel-centré et qui est un peu différent de ce que fait GDAL ou la norme WMS.

source: :ref:`LAYER` Object
fr: Objet :ref:`LAYER`

source: starting with MapServer 5.0, there is no limit to the number of layers in a mapfile
fr: A partir de MapServer 5.0, il n'y a plus de limites au nombre de couches dans un mapfile

source: the `DATA` parameter is relative to the `SHAPEPATH` parameter of the :ref:`MAP` object
fr: le paramètre `DATA` est relatif au paramètre `SHAPEPATH` de l'objet :ref:`MAP`

source: if no `DATA` extension is provided in the filename, MapServer will assume it is ESRI Shape format (.shp)
fr: Si aucune extension n'est fournie dans le nom du paramètre `DATA`, MapServer assume que le format est le format Shape de ESRI(.shp)

source: Raster Layers
fr: Couches Raster

source: Vector Layers
fr: Couches vecteur

source: Vector layers of `TYPE` `point`, `line`, or `polygon` can be displayed. The following example shows how to display only lines from a `TYPE` polygon layer, using the `OUTLINECOLOR` parameter:
fr: Des couches vecteur de `TYPE` `point`, `line`, ou `polygon` peuvent être affichées. L'exemple suivant montre comment afficher seulement les lignes d'une couche de `TYPE` polygon, en utilisant le paramètre `OUTLINECOLOR`:

source: Rendered Bluemarble image with vector boundaries
fr: Rendu d'image Bluemarble avec des limites vecteurs

source: :ref:`CLASS` and :ref:`STYLE` Objects
fr: Objets :ref:`CLASS` et :ref:`STYLE`

source: typical styling information is stored within the :ref:`CLASS` and :ref:`STYLE` objects of a :ref:`LAYER`
fr: Les informations de styles sont typiquement renseignées dans les objets :ref:`CLASS` et :ref:`STYLE` d'une :ref:`LAYER`

source: starting with MapServer 5.0, there is no limit to the number of classes or styles in a mapfile
fr: A partir de MapServer 5.0, il n'y a plus de limites au nombre de couches dans un mapfile

source: the following example shows how to display a road line with two colors by using overlayed `STYLE` objects
fr: l'exemple suivant montre comment afficher un route sous forme de ligne avec deux couleurs en utilisant la superposition d'objets `STYLE`

source: Rendered Bluemarble image with styled roads
fr: Rendu d'image Bluemarble avec des routes stylées

source: can be defined directly in the mapfile, or in a separate file
fr: peut être défini directement dans un mapfile, ou dans un fichier séparé

source: the separate file method must use the `SYMBOLSET` parameter in the `MAP` object:
fr: la méthode avec fichier séparé doit obligatoirement utiliser le paramètre `SYMBOLSET` dans l'objet `MAP`:

source: where symbols.txt might contain:
fr: ou symbols.txt pourrait contenir:

source: and the mapfile would contain:
fr: et le mapfile contiendrait

source: Rendered Bluemarble image with skier symbol
fr: Rendu d'image Bluemarble avec un symbole de skieur

source: :ref:`sym_construction`, :ref:`sym_examples`, and :ref:`symbol`
fr: :ref:`sym_construction`, :ref:`sym_examples`, et :ref:`symbol`

source: defined within a :ref:`CLASS` object
fr: défini à l'intérieur d'un objet :ref:`CLASS`

source: the `LABELITEM` parameters in the :ref:`LAYER` object can be used to specify an attribute in the data to be used for labeling. The label is displayed by the `FONT`, declared in the :ref:`FONTSET` file (set in the :ref:`MAP` object). The :ref:`FONTSET` file contains references to the available font names. `ENCODING` describes which encoding is used in the file (see :ref:`LABELENCODING`).
fr: les paramètres `LABELITEM` dans l'objet :ref:`LAYER` peuvent être utilisés pour indiquer un attribut dans la donnée qui sera utilisé pour l'affichage des étiquettes. L'étiquette est affichée avec la police `FONT`, déclarée dans le fichier :ref:`FONTSET` (défini dans l'objet :ref:`MAP`). Le fichier :ref:`FONTSET` contient les références vers les noms des polices disponibles. `ENCODING` décrit quel encodage est utilisé dans le fichier (voir :ref:`LABELENCODING`).

source: An example :ref:`LABEL` object that references one of the above fonts might look like:
fr: Un exemple d'objet :ref:`LABEL` qui référence une des polices ci-dessus devrait ressembler à:

source: Rendered Bluemarble image with skier symbol and a label
fr: Rendu d'image Bluemarble avec un symbole de sskieur et une étiquette

source: :ref:`CLASS` :ref:`Expressions <expressions>`
fr: :ref:`Les expressions <expressions>` dans :ref:`CLASS`

source: MapServer supports three types of :ref:`CLASS` :ref:`expressions` in a :ref:`LAYER` (`CLASSITEM` in `LAYER` determines the attribute to be used for the two first types of expressions):
fr: MapServer supporte trois types d\':ref:`expressions` de :ref:`CLASS` dans une :ref:`LAYER` (un `CLASSITEM` dans une `LAYER` détermine l'attribut qui doit être utilisé pour les deux premiers types d'expressions):

source: String comparisons
fr: Comparaison de chaînes

source: Regular expressions
fr: Expressions régulières

source: Logical expressions
fr: Expressions logiques

source: Logical expressions should be avoided wherever possible as they are very costly in terms of drawing time.
fr: Les expressions logiques doivent être évitées autant que possible car elles sont très coûteuses en terme de temps de rendu.

source: Added to MapServer 4.10, any part of the mapfile can now be stored in a separate file and added to the main mapfile using the :ref:`INCLUDE` parameter. The filename to be included can have any extension, and it is always relative to the main .map file. Here are some potential uses:
fr: Ajouté à partir de la version de MapServer 4.10, chaque partie d'un mapfile peut être stocké dans un fichier séparé et appelé par le mapfile principal en utilisant le paramètre :ref:`INCLUDE`. Le nom du fichier inclut peut avoir n'importe quelle extension, et son chemin est toujours relatif à celui du fichier mapfile principal. Voici quelques usages potentiels :

source: :ref:`LAYER`\s can be stored in files and included to any number of applications
fr: les couches :ref:`LAYER` peuvent être stockées dans des fichiers et inclut dans dans de nombreuses applications

source: :ref:`STYLE`\s can also be stored and included in multiple applications
fr: Les :ref:`STYLE`\s peuvent être aussi stockés et inclus dans de multiples applications

source: The following is an example of using mapfile :ref:`includes <include>` to include a layer definition in a separate file:
fr: L'exemple suivant est un exemple d'utilisation de mapfile :ref:`includes <include>` pour inclure une définition de couche dans un fichier séparé:

source: If 'shadedrelief.lay' contains:
fr: Si 'shadedrelief.lay' contient:

source: therefore the main mapfile would contain:
fr: en conséquent le fichier mapfile principal devrait contenir:

source: The following is an example of a mapfile where all :ref:`LAYER` s are in separate .lay files, and all other objects (:ref:`WEB`, :ref:`REFERENCE`, :ref:`SCALEBAR`, etc.) are stored in a ".ref" file:
fr: Le contenu suivant est un exemple de mapfile où toutes les couches :ref:`LAYER` sont dans fichiers .lay séparés, et tous les autres objets ( :ref:`WEB`\, :ref:`REFERENCE`\, :ref:`SCALEBAR`\, etc.) sont stockés dans un fichier « .ref » :

source: :ref:`Mapfiles <mapfile>` must have the ``.map`` extension or MapServer will not recognize them. Include files can have any extension you want, however.
fr: Les :ref:`Mapfiles <mapfile>` doivent obligatoirement avoir une extension ``.map`` ou alors MapServer ne les reconnaîtra pas. Les fichiers inclus peuvent par contre avoir n'importe quelle extension.

source: Get MapServer Running
fr: Avoir un Mapserver fonctionnel

source: You can test if MapServer is working by running the MapServer executable (``mapserv``) with the -v parameter on the command line (./mapserv -v). Depending on your configuration, the output could be something like this:
fr: Vous pouvez tester si MapServer fonctionne en lançant l'exécutable Mapserver (``mapserv``) avec le paramètre -v dans la ligne de commande (./mapserv -v). En fonction de votre configuration, la sortie devrait ressembler à quelque chose comme ceci :

source: You can also send a HTTP request directly to the MapServer CGI program without passing any configuration variables (e.g. http://your.domain.name/cgi-bin/ms4/mapserv.exe). If you receive the message, 'No query information to decode. `QUERY_STRING` not set.', your installation is working.
fr: Vous pouvez aussi faire une requête HTTP directement au programme CGI MapServer sans passer de variables de configuration (c'est à dire http://your.domain.name/cgi-bin/ms4/mapserv.exe). Si vous recevez le message, 'No query information to decode. QUERY_STRING is set, but empty.', votre installation fonctionne.

source: Get Demo Running
fr: Avoir une démo qui tourne

source: Download the `MapServer Demo <http://maps.dnr.state.mn.us/mapserver_demos/workshop-5.4.zip>`__. UnZip it and follow the directions in ReadMe.txt. You will need to move the demo files to their appropriate locations on your web server, and modify the Map File and HTML pages to reflect the paths and URLs of your server. Next, point your browser to init.html and hit the 'initialize button'. If you get errors, verify that you have correctly modified the demo files.
fr: Télécharger la `Demo MapServer <http://maps.dnr.state.mn.us/mapserver_demos/workshop-5.4.zip>`__. Dézippez-le et suivez les indications dans ReadMe.txt. Vous devrez déplacer les fichiers de démo aux bons emplacements sur votre serveur web, et modifier le fichier Mapfile et les pages HTML pour adapter les chemins et les URL pour votre serveur. Après, faites pointer votre navigateur vers la page init.html et cliquer sur le 'initialize button'. Si vous avez des erreurs, vérifier que vous avez correctement modifier les fichiers de demo.

source: Making the Site Your Own
fr: S'approprier le site pour votre usage

source: Now that you have a working MapServer demo, you can use the demo to display your own data. Add new `LAYER`\s to your Map file that refer to your own geographic data layers (you will probably want to delete the existing layers or set their status to `OFF`).
fr: Maintenant que vous avez une démo Mapserver fonctionnelle, vous pouvez utiliser la démo pour afficher votre propre donnée. Ajouter de nouvelles couches `LAYER` à votre fichier .map qui pointe vers vos propres données géographiques (vous voudrez probablement supprimer les couches existantes ou mettre le statut de la `LAYER` à `OFF`).

source: Unless you are adding layers that fall within the same geographic area as the demo, modify :ref:`MAP` `EXTENT` to match the extent of your data. To determine the extent of your data, you can use `ogrinfo <http://www.gdal.org/ogrinfo.html>`__. If you have access to a GIS, you could use that as well. The :ref:`MAP` `EXTENT` needs to be in the units of your output projection.
fr: A moins que vous n'ajoutiez des couches qui tombent dans la même étendue géographique que la démo, modifier l'étendue (`EXTENT`) de la carte ( :ref:`MAP` ) qui corresponde à celle de vos données. Pour déterminer l'étendue de vos données, vous pouvez utiliser `ogrinfo <http://www.gdal.org/ogrinfo.html>`__. Si vous avez accès à un logiciel GIS, vous pouvez aussi l'utiliser pour cela aussi. L'étendue (`EXTENT`) de la carte ( :ref:`MAP` ) nécessite d'être dans l'unité de votre projection en sortie.

source: If you add geographic data layers with different geographical reference systems, you will need to modify your Map File to add a :ref:`PROJECTION` block to the :ref:`map` (defines the output projection / geographical reference system) and each of the :ref:`layer`\s (defines the geographical reference system of the layer dataset).
fr: Si vous ajoutez des couches de données géographiques avec des systèmes de référence géographiques différentes, vous devrez modifier votre fichier .map pour ajouter un bloc de a :ref:`PROJECTION` à la carte :ref:`map` (définir la projection de sortie / le système de référence géographique) et à chacune des couches :ref:`layer` (définit le système de référence géographique du jeu de données de la couche).

source: Adding Data to Your Site
fr: Ajouter des données à votre site

source: MapServer supports several data input formats 'natively', and many more if it is compiled with the open source libraries :term:`GDAL` and :term:`OGR`.
fr: MapServer supporte de nombreux formats en entrée 'nativement', et beaucoup plus s'il est compilé avec les bibliothèques open source :term:`GDAL` et :term:`OGR`.

source: Vector Data
fr: Données vecteur

source: Vector data includes features made up of points, lines, and polygons. MapServer support the ESRI Shape format by default, but it can be compiled to support spatially enabled databases such as `PostgreSQL-PostGIS <http://postgis.refractions.net/>`__, and file formats such as `Geography Markup Language (GML) <http://en.wikipedia.org/wiki/Geography_Markup_Language>`__, `MapInfo <http://www.mapinfo.com/>`__, delimited text files, and more formats with :ref:`ogr`.
fr: Les données vecteur incluent des objets constitués de points, lignes, et polygones. MapServer supporte le format ESRI Shape par défaut, mais il peut être compilé pur supporter des bases de données spatiales `PostgreSQL-PostGIS <http://postgis.refractions.net/>`__, et des formats de fichiers comme `Geography Markup Language (GML) <http://en.wikipedia.org/wiki/Geography_Markup_Language>`__, `MapInfo <http://www.mapinfo.com/>`__, les fichiers texte délimités, et plus de formats avec :ref:`ogr`.

source: See the :ref:`Vector Data reference <vector>` for examples on how to add different geographic data sources to your MapServer project.
fr: Voir la the :ref:`référence des données vecteur <vector>` par exemple sur comment ajouter des sources de données géographiques à votre projet MapServer.

source: Raster Data
fr: Données Raster

source: Raster data is image or grid data. By default, MapServer supports Tiff/GeoTiff, and EPPL7. With `GDAL <http://www.gdal.org/>`__, it supports GRASS, Jpeg2000, ArcInfo Grids, and `more formats <http://www.gdal.org/formats_list.html>`__. If you do compile MapServer with GDAL, which includes tiff support, do not compile with native tiff support, as this will cause a conflict. More specific information can be found in the :ref:`Raster Data reference <raster>`.
fr: Les données Raster ou données grilles. Par défaut, MapServer supporte les Tiff/GeoTiff, et les EPPL7. Avec `GDAL <http://www.gdal.org/>`__, il supporte GRASS, Jpeg2000, les grilles ArcInfo, et `plus de formats <http://www.gdal.org/formats_list.html>`__. Si vous compilez MapServer avec GDAL, qui inclut le support des tiff, vous ne devez pas compiler avec le support natif tiff, comme cela pourrait engendrer un conflit. Des informations plus spécifiques peuvent être trouvés dans :ref:`la référence des données Raster <raster>`.

source: Because the earth is round and your monitor (or paper map) is flat, distortions will occur when you display geographic data in a two-dimensional image. Projections allow you to represent geographic data on a flat surface. In doing so, some of the original properties (e.g. area, direction, distance, scale or conformity) of the data will be distorted. Different projections excel at accurately portraying different properties. A good `primer <http://www.colorado.edu/geography/gcraft/notes/mapproj/mapproj_f.html>`__ on map projections can be found at the University of Colorado.
fr: Parce que La Terre est ronde et que votre moniteur (ou carte papier) est plat, des distorsions auront lieus quand vous rendez des données géographiques dan une image deux-dimensions. Les projections vous permettent de représenter des données géographiques sur une surface plane. En faisant ainsi, quelques unes des propriétés originales (c'est à dire la direction, la distance, l'échelle ou la conformité) de la donnée seront distordues. Des projections différentes excellent chacune pour garder fidèlement différentes propriétés. Une bonne `introduction <http://www.colorado.edu/geography/gcraft/notes/mapproj/mapproj_f.html>`__ sur les projections cartographiques peuvent être trouvées à l'université du Colorado.

source: With MapServer, if you keep all of your spatial data sets in the same projection (or unprojected Latitude and Longitude), you do not need to include any projection info in your Map File. In building your first MapServer application, this simplification is recommended.
fr: Avec MapServer, si vous gardez tous vos jeux de données spatiales dans la même projection (ou non projeté Latitude et Longitude), vous n'avez plus besoin d'inclure des nouvelles informations de projection dans votre fichier .map. En construisant votre propre application MapServer, cette simplification est recommandée.

source: On-the-fly projection can be accomplished when MapServer is compiled with :term:`Proj.4` support. Instructions on how to enable Proj.4 support on Windows can be found on the `Wiki <https://github.com/mapserver/mapserver/wiki/WindowsProjHowto>`__.
fr: La projection à la volée peut être accompli quand MapServer est compilé avec le support de :term:`Proj.4`. Les instructions sur comment permettre le support de Proj.4 sur Windows peut être trouvé sur le `Wiki <https://github.com/mapserver/mapserver/wiki/WindowsProjHowto>`__.

source: Enhancing your site
fr: Améliorer votre site

source: Adding Query Capability
fr: Ajouter la possibilité d'interrogation

source: There are two primary ways to query spatial data. Both methods return data through the use of templates and CGI variable replacement. A :ref:`QUERYMAP` can be used to map the results of the query.
fr: Il y a deux manières principales de faire des requêtes sur des données spatiales. Les deux méthodes retournent des données via l'utilisation de templates et de variables de substitution CGI. Une :ref:`QUERYMAP` peut être utilisé pour cartographier les résultats d'un requête.

source: To be queryable, each mapfile :ref:`LAYER` must have a :ref:`TEMPLATE <template>` defined, or each :ref:`CLASS` within the LAYER must have a TEMPLATE defined. More information about the CGI variables used to define queries can be found in the :ref:`MapServer CGI Reference <cgi>`.
fr: Pour être interrogeable, chaque mapfile :ref:`LAYER` peut avoir un :ref:`TEMPLATE <template>` défini, ou chaque :ref:`CLASS` à l'intérieur d'une LAYER doit avoir un TEMPLATE défini. Plus d'informations sur les variables CGI utilisées pour définir les requêtes peut être trouvées sur la :ref:`Référence CGI de MapServer <cgi>`.

source: Attribute queries
fr: Requêtes attributaires

source: The user selects features based on data associated with that feature. 'Show me all of the lakes where depth is greater than 100 feet', with 'depth' being a field in the Shape dataset or the spatial database. Attribute queries are accomplished by passing query definition information to MapServer in the URL (or form post). Mode=itemquery returns a single result, and mode=itemnquery returns multiple result sets.
fr: L'utilisateur sélectionne des objets basés sur les données associées avec cet objet. 'Montre moi tous les lacs où la profondeur est supérieure à 100 pieds', avec 'depth' qui est un champ dans le jeu de données Shape ou la base de données spatiale. Les requêtes attributaires sont accomplies en passant l'information pour la définition de la requête à MapServer dans l'URL (ou un formulaire or form post). Mode=itemquery retourne un résultat simple, et mode=itemnquery retourne un ensemble de résultats.

source: The request must also include a QLAYER, which identifies the layer to be queried, and a QSTRING which contains the query string. Optionally, QITEM, can be used in conjunction with QSTRING to define the field to be queried. Attribute queries only apply within the `EXTENT` set in the map file.
fr: La requête doit aussi inclure une QLAYER, qui identifie la couche à interroger, et un QSTRING qui contient la chaîne d'interrogation. De manière optionnelle, QITEM, peut être utilisé en conjonction avec QSTRING pour définir le champ qui doit être interrogé. Les requêtes attributaires s'appliquent seulement à l'intérieur l'étendue `EXTENT` defini dans le fichier .map.

source: Spatial queries
fr: Requêtes spatiales

source: The user selects features based on a click on the map or a user-defined selection box. Again the request is passed through a URL or form post. By setting mode=QUERY, a user click will return the one closest feature. In mode=NQUERY, all features found by a map click or user-defined selection box are returned. Additional query options can be found in the :ref:`cgi` documentation.
fr: L'utilisateur sélectionne les objets en fonction du clic sur la carte ou en fonction d'une boîte de sélection défini par l'utilisateur. De nouveau, la requête est passée par une URL ou un formulaire de post. En définissant mode=QUERY, un clic utilisateur retournera l'objet le plus proche. En mode=NQUERY, tous les objets trouvés par un clic sur la carte ou une sélection rectangulaire sont retournés. Les options de requêtes addittionnels peuvent être trouvées dans la documentation :ref:`cgi`.

source: See: OpenLayers http://openlayers.org
fr: Voir: OpenLayers http://openlayers.org

source: Data Optimization
fr: Optimisation de données

source: Data organization is at least as important as hardware configuration in optimizing a MapServer application for performance. MapServer is quite efficient at what it does, but by reducing the amount of processing that it needs to do at the time of a user request, you can greatly increase performance. Here are a few rules:
fr: L'organisation des données est au moins aussi importante que la configuration logicielle pour optimiser une application MapServer pour la performance. MapServer est plutôt efficace pour ce qu'il fait, mais en réduisant la quantité de traitements dont il a besoin pour répondre à une seule requête utilisateur, vous pourrez grandement augmenter les performances. Voici quelques règles:

source: **Index Your data** - By creating spatial indexes for your Shape datasets using :ref:`shptree`. Spatial indexes should also be created for spatially aware databases such as PostGIS and Oracle Spatial.
fr: **Indexer vos données** -En créant des index spatiaux pour vos jeux de données Shape en utilisant :ref:`shptree`. Les index spatiaux devraient aussi être créé pour les bases de données spatiales comme PostGIS ou Oracle Spatial.
