Repository: 3x0dv5/docs
Catalog: translated/*/products.po
Languages: es

source: MapServer Suite Products
es: Productos MapServer Suite

source: Since the MapServer 6.0 release, the MapServer project includes a suite of Open Source products, to provide a full set of online mapping tools to the community. The MapServer Project Steering Committee maintains all of these products under the single umbrella of MapServer.
es: Desde el lanzamiento de MapServer 6.0, el proyecto de MapServer incluye un suite de productos de código abierto, para proporcionar un conjunto completo de herramientas de mapeo en línea para la comunidad. El Cómite Directivo del Proyecto MapServer mantiene todos estos productos bajo la misma organización de MapServer

source: Developers looking to contribute to the Github projects should review MapServer's :ref:`Github guidelines <git>`
es: Los desarrolladores que buscan contribuir a los proyectos de Github deben revisar :ref:`Directrices Github <git>` de MapServer

source: MapServer Core
es: Núcleo MapServer

source: The mapServer core source code, written in C, and consistently is one of the fastest and most configurable online mapping engines in the world.
es: El código fuente del núcleo de MapServer, esta escrito en C, y consistentemente es uno de los más rápidos y configurables de mapas en línea en el mundo.

source: :ref:`Documentation home <documentation>`
es: :ref:`Documentación <documentation>`

source: :ref:`Download <source>`
es: :ref:`Descargas <source>`

source: `Github home <https://github.com/mapserver/mapserver/>`__
es: `Sitio Github <https://github.com/mapserver/mapserver/>`__

source: As of MapServer 6.0, MapServer also includes powerful tile caching capabilities through the MapCache project.
es: A partir de MapServer 6.0, Mapserver también tiene incluye potentes capacidades tiles del almacenamiento en cache a través del proyecto MapCache.

source: :ref:`Documentation home <mapcache>`
es: :ref:`Documentación <mapcache>`

source: `Github home <https://github.com/mapserver/mapcache/>`__
es: `Sitio Github <https://github.com/mapserver/mapcache/>`__

source: As of MapServer 6.0, MapServer also includes the much needed ability to perform transactional requests (online editing of features) through the WFS specification, using the TinyOWS project.
es: A partir de MapServer 6.0, MapServer incluye también la capacidad necesaria para realizar peticiones transaccionales (edición en línea de objetos espaciales) a través de la especificación WFS, con el proyecto TinyOWS.

source: :ref:`Documentation home <tinyows>`
es: :ref:`Documentación <tinyows>`

source: `Github home <https://github.com/mapserver/tinyows/>`__
es: `Sitio Github <https://github.com/mapserver/tinyows/>`__
